{
    "Health": "Affenpinschers are generally healthy dogs, and responsible breeders will screen their stock for health conditions such as luxating patella, heart anomalies, vision problems, and hip dysplasia. Like other shorter-faced breeds, Affens can experience breathing problems during hot weather if they are permitted to overheat and then have difficulty panting in order to lower their body temperature, as dogs don't sweat to keep cool.",
    "Recommended Health Tests": [
        "Patella Evaluation",
        "Ophthalmologist Evaluation"
    ],
    "Grooming": null,
    "Exercise": "Affenpinschers are generally healthy dogs, and responsible breeders will screen their stock for health conditions such as luxating patella, heart anomalies, vision problems, and hip dysplasia. Like other shorter-faced breeds, Affens can experience breathing problems during hot weather if they are permitted to overheat and then have difficulty panting in order to lower their body temperature, as dogs don't sweat to keep cool.",
    "Training": "The Affenpinscher's medium-length, wiry coat should be groomed twice a week, first with a brush and then with a metal comb. Any mats should be pulled apart with the fingers. The hair on the head is usually brushed forward over the face, and then an inverted V-shape is cut to expose the eyes. Similarly, the hair on the bridge of the nose is trimmed into a fan shape to keep the eyes clear. The Affen's coat does not grow quickly, so a trimming a pet Affen every few months should suffice. The breed's national parent club, the Affenpinscher Club of America, provides a detailed grooming guide. Affens should also have their nails trimmed and their teeth brushed regularly.",
    "Nutrition": "One of the attractions of the toy breeds is that their small size makes them ideal apartment dogs. While Affenpinschers can be perfectly happy living in close quarters, the breed is classified as 'moderately active,' and as such, they do need exercise. Indoor play, both with his owner and just between himself and a toy, can be enough to make up a large chunk of an Affen's exercise regimen. Even so, a brisk walk once or twice a day is required. In addition to providing exercise, these walks give the Affen a chance to socialize both with people and other dogs."
}