{
    "Affenpinscher": {
        "url": "https://www.akc.org/dog-breeds/affenpinscher/",
        "scraped_data": {
            "Health": "Affenpinschers are generally healthy dogs, and responsible breeders will screen their stock for health conditions such as luxating patella, heart anomalies, vision problems, and hip dysplasia. Like other shorter-faced breeds, Affens can experience breathing problems during hot weather if they are permitted to overheat and then have difficulty panting in order to lower their body temperature, as dogs don't sweat to keep cool.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Affenpinschers are generally healthy dogs, and responsible breeders will screen their stock for health conditions such as luxating patella, heart anomalies, vision problems, and hip dysplasia. Like other shorter-faced breeds, Affens can experience breathing problems during hot weather if they are permitted to overheat and then have difficulty panting in order to lower their body temperature, as dogs don't sweat to keep cool.",
            "Training": "The Affenpinscher's medium-length, wiry coat should be groomed twice a week, first with a brush and then with a metal comb. Any mats should be pulled apart with the fingers. The hair on the head is usually brushed forward over the face, and then an inverted V-shape is cut to expose the eyes. Similarly, the hair on the bridge of the nose is trimmed into a fan shape to keep the eyes clear. The Affen's coat does not grow quickly, so a trimming a pet Affen every few months should suffice. The breed's national parent club, the Affenpinscher Club of America, provides a detailed grooming guide. Affens should also have their nails trimmed and their teeth brushed regularly.",
            "Nutrition": "One of the attractions of the toy breeds is that their small size makes them ideal apartment dogs. While Affenpinschers can be perfectly happy living in close quarters, the breed is classified as 'moderately active,' and as such, they do need exercise. Indoor play, both with his owner and just between himself and a toy, can be enough to make up a large chunk of an Affen's exercise regimen. Even so, a brisk walk once or twice a day is required. In addition to providing exercise, these walks give the Affen a chance to socialize both with people and other dogs."
        }
    },
    "Afghan Hound": {
        "url": "https://www.akc.org/dog-breeds/afghan-hound/",
        "scraped_data": {
            "Health": "Sighthounds such as Afghans have naturally low stores of body fat, so they tend to be sensitive to anesthesia; breed experts recommend seeking out a sighthound-savvy veterinarian for surgical procedures. Like other deep-chested types of dogs, Afghan Hounds can experience bloat, a sudden and life-threatening swelling of the abdomen, and owners should educate themselves about its symptoms and what to do should bloat occur.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Thyroid Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Sighthounds such as Afghans have naturally low stores of body fat, so they tend to be sensitive to anesthesia; breed experts recommend seeking out a sighthound-savvy veterinarian for surgical procedures. Like other deep-chested types of dogs, Afghan Hounds can experience bloat, a sudden and life-threatening swelling of the abdomen, and owners should educate themselves about its symptoms and what to do should bloat occur.",
            "Training": "Afghan puppies have short, fuzzy coats (including adorable facial hair called 'monkey whiskers') that require little maintenance. They don't stay that way for long, however. As is to be expected, the long, silky coat of an adolescent or adult Afghan requires regular grooming. Several hours per week of brushing are needed to keep the hair free of tangles and mats, as well as to remove any debris. Keeping the hair clean and mat-free is the key to keeping the Afghan's glorious coat looking its best. Regular bathing, with shampoo and conditioner, is also required. Like all breeds, Afghans should have their nails trimmed and their teeth brushed regularly.",
            "Nutrition": "Because Afghans are sighthounds, bred to hunt and chase prey by sight, they will have a strong instinct to run off in pursuit of perceived prey; walking off leash is not advisable. Short walks do not provide enough exercise for this athletic breed, and some owners take their leashed Afghans on long runs once they reach maturity. Ideally, an Afghan should have the opportunity to run full out several times a week in a large, enclosed area. Afghans are tall, lean, and strong, which makes them excellent jumpers, so their exercise area must have a high, secure fence."
        }
    },
    "Airedale Terrier": {
        "url": "https://www.akc.org/dog-breeds/airedale-terrier/",
        "scraped_data": {
            "Health": "Airedales are generally healthy dogs, and responsible breeders will test for health concerns such as hip dysplasia, a malformation of the hip joint. An Airedale's ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and his teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Kidney Disease Screening (CHIC)",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Airedales are generally healthy dogs, and responsible breeders will test for health concerns such as hip dysplasia, a malformation of the hip joint. An Airedale's ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and his teeth should be brushed regularly.",
            "Training": "The Airedale has a short, wiry coat that needs relatively little maintenance. Weekly brushing keeps the coat looking good and has the additional advantage of removing dead hair that would otherwise be shed around the house. (Some people with dog allergies have found that they can share a living space with a well-brushed Airedale without suffering any symptoms.) If the weekly session turns up any mats, they should be broken up with the fingers and then teased apart with a comb. Full grooming ' where the dog is bathed, brushed, and stripped or clipped ' should be done three or four times a year, either by the owner or a professional groomer.",
            "Nutrition": "Terriers are generally known for their high energy levels. Given that the Airedale is the largest of all terriers, that energy must be channeled into safe outlets. Fortunately, Airedales love to play with other family members. A daily play session of moderate length, in addition to walks (or backyard time) several times a day, should be enough to satisfy the Airedale's exercise requirements. Airedales play well with children, but interactions with toddlers and smaller children should be closely supervised. Airedales are rangy but strong; that strength, combined with a boisterous personality, can lead to mishaps."
        }
    },
    "Akita": {
        "url": "https://www.akc.org/dog-breeds/akita/",
        "scraped_data": {
            "Health": "Like many dogs, Akitas can experience bloat, a sudden, life-threatening condition where the stomach can twist without veterinary intervention. Bloat is a medical emergency, and Akita owners should learn to recognize the signs. Prospective owners should be sure to work with a reputable breeder who tests his or her breeding stock for health concerns such as eye and thyroid disorders, and hip dysplasia, a malformation of the hip joints that can cause pain and arthritis.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Thyroid Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Like many dogs, Akitas can experience bloat, a sudden, life-threatening condition where the stomach can twist without veterinary intervention. Bloat is a medical emergency, and Akita owners should learn to recognize the signs. Prospective owners should be sure to work with a reputable breeder who tests his or her breeding stock for health concerns such as eye and thyroid disorders, and hip dysplasia, a malformation of the hip joints that can cause pain and arthritis.",
            "Training": "Akitas tend to be clean and have little 'doggy odor.' They don't require extensive grooming, but their thick, luxurious double coat should be brushed at least once a week to look its best. Although Akitas shed only minimally most of the time, expect their dense undercoat to 'blow' twice a year, where it will shed so profusely that it comes out in clumps all over your house. During this time it helps to brush the dog more frequently to get rid of the dead coat. The nails should also be trimmed regularly, as overly long nails can cause pain and problems for the dog. Remember also to brush the dog's teeth often to ensure dental health.",
            "Nutrition": "The Akita is generally not a highly active breed but does require moderate exercise. A jog or brisk walk around the block at least once a day can meet the needs of most individuals of the breed. Akitas also enjoy playing energetically. Although they are large dogs ' males often weigh more than 100 pounds ' with sufficient daily exercise Akitas can do well in a relatively small home. They are hardy dogs bred to withstand the harsh outdoor conditions of northern Japan, but they were bred as housedogs and guardians as well as hunters, and adapt very well to life in the home."
        }
    },
    "Alaskan Klee Kai": {
        "url": "https://www.akc.org/dog-breeds/alaskan-klee-kai/",
        "scraped_data": {
            "Health": "The Alaskan Klee Kai (AKK) is a generally healthy breed.  Responsible breeders screen breeding stock for health conditions including patellar luxation, autoimmune thyroiditis, heart murmur, eye disorders, and Factor VII deficiency.  Prospective AKK owners are  encouraged to purchase from responsible/reputable breeders who are doing these  evaluations, and confirm the health screening of the sire and dam.  Responsible breeders use the many tools available, along with the knowledge of their dogs' pedigrees, to  selectively choose breeding dogs in order to reduce the likelihood of temperament,  structure and health concerns.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "Ophthalmologist Evaluation",
                "Thyroid Evaluation",
                "Factor VII DNA Test",
                "Cardiac Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Alaskan Klee Kai (AKK) is a generally healthy breed.  Responsible breeders screen breeding stock for health conditions including patellar luxation, autoimmune thyroiditis, heart murmur, eye disorders, and Factor VII deficiency.  Prospective AKK owners are  encouraged to purchase from responsible/reputable breeders who are doing these  evaluations, and confirm the health screening of the sire and dam.  Responsible breeders use the many tools available, along with the knowledge of their dogs' pedigrees, to  selectively choose breeding dogs in order to reduce the likelihood of temperament,  structure and health concerns.",
            "Training": "The Alaskan Klee Kai (AKK) is a double coated breed, with a short dense undercoat and a longer outer coat of guard hairs. This coat not only helps insulate them from the cold and heat, it also helps protect the skin from the sun. While the undercoat is shed (or blown) twice a year, some owners quip that it lasts for six months at a time. Weekly brushings and/or combing help keep the coat and skin in good condition, and help reduce the hair around the house.  AKK often need only a few baths a year as their coats tend to naturally repel dirt, and they do not have the dog odor that many breeds have. Blowing the dog with a strong cool blow-dryer is also a good way to remove loose hair and dirt. Avoid using any tools with blades. The nails should be trimmed regularly to prevent any foot problems.  Alaskan Klee Kai competing in conformation require a bit more selective grooming or bathing for the best presentation. The breed standard is specific: \"The Alaskan Klee Kai is shown in its natural state and the only trimming permissible is around the foot area to present a clean/neat appearance. Any trimming of the whiskers, or the fur on any other part of the dog, is to be severely penalized.\"",
            "Nutrition": "The Alaskan Klee Kai (AKK) is an active dog with a medium-high energy level. Regular exercise and doing activities together, both physically and mentally, strengthens the bond between dog and owner, and helps to avoid potential destructive behavior. AKK enjoy doing performance sports or exploring life with their people in many activities such as camping, hiking, climbing, swimming, boating, kayaking, and even on paddle boards! For those who live in a more urban setting, or have a more sedate lifestyle, daily walks or a game of fetch can also provide great exercise. Alaskan Klee Kai are foremost loving companion dogs who form strong bonds with their family and are as happy playfully interacting with their owners exploring the outdoors as they are relaxing lovingly on the laps of their youthful or elderly owners. Like many dog breeds, Alaskan Klee Kai are curious, clever, fast and sneaky, and may have a high prey drive, so it is important to keep the dog on a leash or in a securely fenced area at all times when outside of the home. AKK are not suitable for people who cannot spend time with their dogs"
        }
    },
    "Alaskan Malamute": {
        "url": "https://www.akc.org/dog-breeds/alaskan-malamute/",
        "scraped_data": {
            "Health": "A responsible breeder will screen breeding stock for health conditions such as hip dysplasia (a malformation of the hip joint that is the most common skeletal condition in dogs), elbow dysplasia, thrombopathia, chondrodysplasia ('dwarfism'), hypothyroidism, inherited polyneuropathy, von Willebrand's disease, and day blindness. As with all breeds, an Alaskan Malamute's ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and his teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Alaskan Malamute Polyneuropathy (AMPN) - DNA Test",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "A responsible breeder will screen breeding stock for health conditions such as hip dysplasia (a malformation of the hip joint that is the most common skeletal condition in dogs), elbow dysplasia, thrombopathia, chondrodysplasia ('dwarfism'), hypothyroidism, inherited polyneuropathy, von Willebrand's disease, and day blindness. As with all breeds, an Alaskan Malamute's ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and his teeth should be brushed regularly.",
            "Training": "The thick, waterproof double coat of the Alaskan Malamute is beautifully adapted to harsh Arctic life, but it requires constant upkeep. A Malamute should be brushed every day with a pin brush and metal comb, all the while checking for mats, which can harbor fungus, and hot spots, which can become infected. Twice a year, during shedding season, an undercoat rake should be added to the regimen. Show Malamutes are often bathed weekly, but a pet Malamute can go six to eight weeks between baths.  Conditioner can be used, in moderation, if the coat feels dry. As with all breeds, the Malamute's nails should be trimmed regularly.",
            "Nutrition": "While the Malamute was not bred for racing, he was bred to work. A strong, athletic dog with tremendous endurance, designed to carry heavy loads, a Mal requires daily exercise. Romping in a well-fenced yard or other enclosed space will suffice, but Malamutes also enjoy hiking, running, and swimming with their owners. And should the owner have sufficient time and interest, Malamutes often take part in agility and obedience trials, weight-pulling competitions, backpacking (yes, you can buy a backpack for your dog), recreational or competitive sledding, and skijoring (pulling a person who is on skis)."
        }
    },
    "American Bulldog": {
        "url": "https://www.akc.org/dog-breeds/american-bulldog/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "The American Bulldog is considered a healthy breed. Owners should maintain a schedule of examinations and vaccinations as recommended by their veterinarian. Hip and joint problems are a concern for this breed, hip and elbow evaluations should also be done. Just like other breeds, the American Bulldog has the potential to develop genetic health problems. Breeders should pre-screen any potential breeding pairs for genetic diseases.",
            "Training": "Grooming your American Bulldog can be a pretty easy task. This breed does not need to be bathed often, only occasional baths when they become dirty. Regular brushing will help keep their coat clean and shiny. Their nails should be trimmed every few weeks and ears should be cleaned once a month or as needed. Their teeth should be brushed regularly. Seasonal shedding is to be expected.",
            "Nutrition": "The American Bulldog is an athlete. For puppies, owners will need to practice non-impact exercises to decrease possible bone and joint damage. As adults, the American Bulldog will need a range of activities from jogs, hikes, tug-a-war games, to training exercises. The breed does not do well being left alone in a back yard. As this may lead to a variety of behavior problems related to pent-up energy. This breed requires frequent exercise and constant stimulation. Developing his athletic abilities will help this breed stay fit and happy."
        }
    },
    "American English Coonhound": {
        "url": "https://www.akc.org/dog-breeds/american-english-coonhound/",
        "scraped_data": {
            "Health": "Still bred primarily as a hard-working dog, which must have an efficient physical condition, the American English Coonhound is generally a healthy breed. Responsible breeders will screen their stock for health conditions such as hip and elbow dysplasia as well as eye disorders such as progressive retinal atrophy and cataracts. His ears should be checked regularly to remove excess wax and debris. Like other large and deep-chested breeds, he can experience bloat, a sudden, life-threatening stomach condition. Owners should learn the signs of bloat and what to do should it occur.",
            "Recommended Health Tests": [
                "No recommended health tests"
            ],
            "Grooming": null,
            "Exercise": "Still bred primarily as a hard-working dog, which must have an efficient physical condition, the American English Coonhound is generally a healthy breed. Responsible breeders will screen their stock for health conditions such as hip and elbow dysplasia as well as eye disorders such as progressive retinal atrophy and cataracts. His ears should be checked regularly to remove excess wax and debris. Like other large and deep-chested breeds, he can experience bloat, a sudden, life-threatening stomach condition. Owners should learn the signs of bloat and what to do should it occur.",
            "Training": "Good nutrition influences the shine and texture of your American English Coonhound's coat from the inside, but he will still need regular grooming to be at his best. His short, hard, protective coat requires a minimum of care. Using a shedding tool or a grooming mitt with rubber nubs at least weekly will help to keep his shedding to a minimum. This also distributes skin oils down the hair shaft, giving his coat a natural shine. His nails should be trimmed once a month, and a bath every four to six weeks will keep the coat and skin clean and healthy, and reduce doggy odor. His ears should be checked weekly and gently cleaned of any excess wax or debris.",
            "Nutrition": "With his high energy level and innate desire to be part of a pack, whether human or canine, the American English is an ideal candidate as a companion for someone who is an active runner, biker, or hiker. He needs a lot of exercise to stay healthy and happy. The breed has a very strong prey drive, so should never be allowed off leash in an uncontrolled situation, as he will not be able to resist the instinct to follow an interesting scent he detects with his sensitive nose. He requires a fenced area where he can run freely. Chasing a ball in his backyard can be an excellent source of exercise."
        }
    },
    "American Eskimo Dog": {
        "url": "https://www.akc.org/dog-breeds/american-eskimo-dog/",
        "scraped_data": {
            "Health": "A responsible breeder will test his or her breeding stock for health issues such as hip dysplasia and progressive retinal atrophy. As with all breeds, an Eskie's ears should be checked weekly to remove debris and avoid a buildup of wax, and the dog's teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Progressive Retinal Atrophy, PRCD (PRA-prcd, PRCD) - DNA Test",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "A responsible breeder will test his or her breeding stock for health issues such as hip dysplasia and progressive retinal atrophy. As with all breeds, an Eskie's ears should be checked weekly to remove debris and avoid a buildup of wax, and the dog's teeth should be brushed regularly.",
            "Training": "The American Eskimo Dog's fluffy, white double coat ' a short, dense undercoat below the longer outer coat ' is surprisingly easy to keep clean. However, Eskies shed almost constantly. A thorough brushing two or three times a week will remove dead hairs before they can be shed, as well as help to prevent matting. The oil on an Eskie's fur prevents dirt from adhering, so a good brushing is usually enough to remove it. It is OK to bathe  an Eskie occasionally, but doing so more than once every few months can make his skin dry and irritated. As with all breeds, the Eskie's nails should be trimmed regularly.",
            "Nutrition": "An active dog with lots of energy, the Eskie is also quick and curious, requiring lots of exercise and mental challenges. An Eskie who is left alone or who doesn't get enough exercise can quickly become destructive. A securely fenced yard and an assortment of toys will help provide good exercise and stimulation to keep an Eskie out of trouble. He shouldn't just be left out in the yard by himself all day, however. Despite his warm coat, the Eskie is an indoor dog, and he forms strong bonds with his people and is happiest interacting with them. Once they pass middle age, Eskies often become more sedate."
        }
    },
    "American Foxhound": {
        "url": "https://www.akc.org/dog-breeds/american-foxhound/",
        "scraped_data": {
            "Health": "The American Foxhound is typically a healthy breed, and a responsible breeder will test breeding stock for health conditions such as hip dysplasia and thrombocytopathy, which is a blood disorder. Long-eared breeds can develop ear infections, and a Foxhound's ears should be checked regularly to remove foreign matter and avoid a buildup of wax. Regular brushing will keep the hound's teeth healthy as well.",
            "Recommended Health Tests": [
                "No recommended health tests"
            ],
            "Grooming": null,
            "Exercise": "The American Foxhound is typically a healthy breed, and a responsible breeder will test breeding stock for health conditions such as hip dysplasia and thrombocytopathy, which is a blood disorder. Long-eared breeds can develop ear infections, and a Foxhound's ears should be checked regularly to remove foreign matter and avoid a buildup of wax. Regular brushing will keep the hound's teeth healthy as well.",
            "Training": "The American Foxhound's handsome coat is short and lies close to the body. The coat's hard texture protects the dog from the underbrush he courses through while on the hunt'and the coat also happens to be extremely easy to take care of. A short, once-a-week session with a bristle brush, a rubber grooming mitt or tool, or a hound glove is usually all that is needed. The Foxhound should not need to be bathed unless he gets into something particularly messy while outdoors. As with all breeds, the American Foxhound's nails should be trimmed regularly.",
            "Nutrition": "Foxhounds were bred specifically to spend long hours chasing after prey. That's why an American Foxhound needs at least a solid hour or two of exercise every day'if he doesn't get it, he may become bored and destructive. If they get all the activity they need, they can fit in pretty much anywhere. While they are happiest living indoors with their human family, American Foxhounds make great companions on long walks or hikes. Because they were bred to hunt and chase animals and to follow a scent, they should only be allowed loose in areas that are securely fenced, and any walks must be taken on a leash. The breed also exercises mind and body by participating in canine sports such as tracking, rally, coursing ability tests, and other activities that can be enjoyed together by dog and owner."
        }
    },
    "American Hairless Terrier": {
        "url": "https://www.akc.org/dog-breeds/american-hairless-terrier/",
        "scraped_data": {
            "Health": "Responsible breeders screen for health conditions such as hip dysplasia, cardiac conditions, luxating patella (a dislocated kneecap similar to what is called a 'trick knee' in humans), and Legg-Calve-Perthes disease, a hip condition that can be corrected with surgery. Skin problems are quite rare in the breed. As with all breeds, an American Hairless Terrier's ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and the teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "Hip Evaluation",
                "Cardiac Exam"
            ],
            "Grooming": null,
            "Exercise": "Responsible breeders screen for health conditions such as hip dysplasia, cardiac conditions, luxating patella (a dislocated kneecap similar to what is called a 'trick knee' in humans), and Legg-Calve-Perthes disease, a hip condition that can be corrected with surgery. Skin problems are quite rare in the breed. As with all breeds, an American Hairless Terrier's ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and the teeth should be brushed regularly.",
            "Training": "The American Hairless Terrier actually comes in two varieties: coated and hairless. For either type, grooming needs are minimal. For the hairless variety, there is little maintenance involved other than keeping the ears clean and making sure the dog is protected from sunburn. The variety with a short, shiny coat is almost as carefree. They hardly shed, so all that's called for is a quick session with a soft bristle brush once a week, and an occasional bath as needed. As with all breeds, the American Hairless Terrier's nails should be trimmed regularly.",
            "Nutrition": "The American Hairless Terrier has only moderate exercise needs. They have to go outside several times a day, of course, but brief daily sessions in a fenced-in yard or on regular walks will generally be all they require. They enjoy activity but are also quite happy to curl up on the couch next to their owner. The breed is friendly and happy to play with people or other dogs. Thanks to their high trainability, they can do well in a wide range of canine activities such as obedience, rally, and agility competitions."
        }
    },
    "American Leopard Hound": {
        "url": "https://www.akc.org/dog-breeds/american-leopard-hound/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "Most American Leopard Hounds are healthy dogs. Prospective American Leopard Hound owners should work with a responsible breeder, who can educate them about specific health concerns within the breed. Good breeders utilize genetic testing of their breeding stock to reduce the likelihood of disease in their puppies. The mating of two merle-colored American Leopards creates the possibility of puppies called double merles. These pups carry a much higher risk of being blind, deaf, or sight or hearing-impaired.",
            "Training": "Grooming can be a wonderful bonding experience for you and your dog. American Leopard Hounds have a smooth, dense, double coat; the outer coat is rough and the undercoat is fine and wooly. Beyond regular weekly brushing, the occasional bath will keep them clean and looking their best. Their strong, fast-growing nails should be trimmed regularly with a nail clipper or grinder to avoid overgrowth, splitting and cracking. Their ears should be checked regularly to avoid a buildup of wax and debris which can result in an infection. Teeth should be brushed regularly.",
            "Nutrition": "American Leopard Hounds are an energetic breed. Options for exercise include play time in the backyard, preferably fenced, or walks several times a day. Exercise can also come in the form of indoor activities, like hide-and-seek, chasing a ball rolled along the floor, or teaching them new tricks. Training for dog sports like agility, obedience and rally can also be a great way to give your dog exercise. As a hunting breed with energy to spare, American Leopards would do best as part of an active, rural family."
        }
    },
    "American Staffordshire Terrier": {
        "url": "https://www.akc.org/dog-breeds/american-staffordshire-terrier/",
        "scraped_data": {
            "Health": "The Am Staff is a robust, healthy breed, and a responsible breeder will screen breeding stock for these health conditions such as canine hip dysplasia, cardiac disease, and skin and coat allergies. A genetic test has recently been developed for cerebellar ataxia, which causes a progressive decline in muscle coordination, first appearing between ages 3 and 5 years; now, by identifying dogs with the mutation, breeders can avoid producing it in their bloodlines. As with all breeds, the ears should be checked regularly, and the dog's teeth should be brushed often.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Thyroid Evaluation",
                "Neuronal Ceroid Lipofuscinosis 4A (NCL, NCL4A) - DNA Test",
                "Cardiac Exam"
            ],
            "Grooming": null,
            "Exercise": "The Am Staff is a robust, healthy breed, and a responsible breeder will screen breeding stock for these health conditions such as canine hip dysplasia, cardiac disease, and skin and coat allergies. A genetic test has recently been developed for cerebellar ataxia, which causes a progressive decline in muscle coordination, first appearing between ages 3 and 5 years; now, by identifying dogs with the mutation, breeders can avoid producing it in their bloodlines. As with all breeds, the ears should be checked regularly, and the dog's teeth should be brushed often.",
            "Training": "Taking care of the AmStaff's short, stiff coat is remarkably easy. A quick once-over with a soft bristle brush every week is usually enough to remove any dirt or other foreign matter. What's more, a good brushing distributes skin oils throughout the coat to help keep it healthy. If an Am Staff gets into something particularly messy, a bath will probably be called for. Otherwise, bathing can wait until when and if he develops a 'doggy' smell. As with all breeds, the AmStaff's nails should be trimmed regularly, as overly long nails can be painful and cause the dog problems while walking and running.",
            "Nutrition": "An athletic, energetic dog such as the American Staffordshire Terrier requires a lot of exercise. Leaving the dog out in the yard all day is not the right approach, however: Yes, he can run around, but the AmStaff is a people-oriented dog who thrives when he is made part of the family. Long play sessions with his owner develop his physical and psychological health. In addition, many AmStaffs enjoy taking part in canine sports such as obedience, agility, and dock diving. AmStaffs are even trained in search-and-rescue and excel at it."
        }
    },
    "American Water Spaniel": {
        "url": "https://www.akc.org/dog-breeds/american-water-spaniel/",
        "scraped_data": {
            "Health": "As with all breeds, the majority of American Water Spaniels will live long and healthy lives when given proper care and regular veterinarian visits. A responsible breeder will test breeding stock for health concerns such as hip dysplasia, eye disorders, cardiac abnormalities and degenerative myelopathy.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "As with all breeds, the majority of American Water Spaniels will live long and healthy lives when given proper care and regular veterinarian visits. A responsible breeder will test breeding stock for health concerns such as hip dysplasia, eye disorders, cardiac abnormalities and degenerative myelopathy.",
            "Training": "The American Water Spaniel has a dense, waterproof coat that can be either tightly curled or wavy. The breed was bred to work in the icy waters of the Great Lakes region, and its insulating, double-layer coat makes that possible. Weekly grooming is required, but it is a fairly simple process. During the summer, the coat is sparser, and can be brought into shape with a rubber-tipped pin brush. The rest of the year, and especially during shedding season, a slicker brush should be used to remove the dead hair from the undercoat. As with all breeds, the American Water Spaniel's nails should be trimmed regularly.",
            "Nutrition": "American Water Spaniels are outdoorsy athletes who love hunting and swimming, so they need ample exercise. Without sufficient activity, they can become barky and destructive. At a minimum, vigorous play sessions with their owner or a companion dog in a park or a large backyard are needed every day. They truly thrive, however, when given a job to do and make great hunting companions'after all, it's in their DNA. Participating in field trials or obedience, agility, or dock diving events will give the American Water Spaniel a chance to burn off all that excess energy in a positive way."
        }
    },
    "Anatolian Shepherd Dog": {
        "url": "https://www.akc.org/dog-breeds/anatolian-shepherd-dog/",
        "scraped_data": {
            "Health": "The Anatolian is overall a healthy and hardy breed. Hip dysplasia is not common in Anatolians, nor is bloat, a life-threatening twisting and inversion of the stomach. Owners should know the symptoms of bloat, however, so as to act quickly should it occur. The breed can be sensitive to anesthesia, and owners should ensure that their vet is aware of this before any procedures. Good breeders will screen for entropion, in which the eyelids invert, which can be surgically corrected. An Anatolian's ears should be checked regularly for any signs of infection, and the dog's teeth should be brushed frequently.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Anatolian is overall a healthy and hardy breed. Hip dysplasia is not common in Anatolians, nor is bloat, a life-threatening twisting and inversion of the stomach. Owners should know the symptoms of bloat, however, so as to act quickly should it occur. The breed can be sensitive to anesthesia, and owners should ensure that their vet is aware of this before any procedures. Good breeders will screen for entropion, in which the eyelids invert, which can be surgically corrected. An Anatolian's ears should be checked regularly for any signs of infection, and the dog's teeth should be brushed frequently.",
            "Training": "Bred to work outdoors, the Anatolian has a thick undercoat that protects him from the elements. Some Anatolians have a long outer coat, but on most it is quite short, and a quick brushing once a week will keep it looking good. Keep in mind, though, that the Anatolian sheds his undercoat twice a year. During shedding season, he will need to given a thorough brushing-out to remove the dead hair, with a short-bristle brush and possibly a comb as well, every few days. As with all breeds, the Anatolian's nails should be trimmed regularly.",
            "Nutrition": "Because he only needs a moderate amount of exercise, an Anatolian will be happy with time in a yard'be sure it has a tall, strong fence and a locked gate'and a long walk once or twice a day. Remember, though, that an Anatolian must be kept on leash whenever he is taken out of the home. As one breeder says, \"Don't assume that your dogs will be reliable off leash. False security on your part can become a disaster.'"
        }
    },
    "Appenzeller Sennenhund": {
        "url": "https://www.akc.org/dog-breeds/appenzeller-sennenhund/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "The Appenzeller is a healthy breed with few health issues. Life expectancy is 13 to 15 years, but it is not unheard of for them to live well beyond that.",
            "Training": "Appenzellers have a firm double coat. The topcoat is thick and shiny, and the undercoat is a thick black, brown or gray. Weekly brushing is recommended with a firm brush to remove loose and dead hair. Check frequently for buildup of dirt and foreign bodies in the ears, and if you reside in tick-prone areas, always be sure to check your dog's ears and coat after coming in from walks.",
            "Nutrition": "The Appenzeller is a herding/working breed with boundless energy. They are highly intelligent and need a job to do. Early socialization is necessary, and training at an early age is crucial. They are a strong powerful breed with incredible speed and need plenty of room to run. This is not a breed that thrives in a busy urban environment or in the suburbs unless he has lots of activity, nor is it a breed for kenneling. He prefers to be outside, where his strong herding and guarding instincts and his bond with his territory and his 'people's keep him from running off."
        }
    },
    "Australian Cattle Dog": {
        "url": "https://www.akc.org/dog-breeds/australian-cattle-dog/",
        "scraped_data": {
            "Health": "A responsible breeder will screen breeding stock for health conditions such as deafness; progressive retinal atrophy, or PRA, which causes vision loss; and hip dysplasia. An ACD's ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and his teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "BAER Testing",
                "Primary Lens Luxation (PLL) - DNA Test",
                "Progressive Retinal Atrophy, PRCD (PRA-prcd, PRCD) - DNA Test",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "A responsible breeder will screen breeding stock for health conditions such as deafness; progressive retinal atrophy, or PRA, which causes vision loss; and hip dysplasia. An ACD's ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and his teeth should be brushed regularly.",
            "Training": "The Australian Cattle Dog was bred to work outdoors and has a smooth, double-layer coat that protects him from the elements. This coat has no odor or oily residue, so an Australian Cattle Dog generally needs just a quick brushing once a week and an occasional bath. Keep in mind, though, that the ACD sheds his undercoat twice a year. During shedding season, every few days he will need a thorough brushing-out to remove the dead hair, using a short-bristle brush and possibly a comb as well. As with all breeds, the Australian Cattle Dog's nails should be trimmed regularly.",
            "Nutrition": "A very active, high-energy dog, the Australian Cattle Dog needs more than just a quick walk and playtime in the yard. ACDs really need a job in order to remain happy and healthy. On a working farm, this may not be an issue, especially if there are animals to herd. In other living situations, going with his owner on runs every day, or nearly every day, is a good outlet for his energy. An ideal choice is participation in dog sports, where the Australian Cattle Dog and owner take part in canine activities such as obedience or agility that channel the breed's drive and abundant energy in a fun way."
        }
    },
    "Australian Kelpie": {
        "url": "https://www.akc.org/dog-breeds/australian-kelpie/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "Most Australian Kelpies are healthy dogs. Working with a responsible breeder, those wishing to own a Kelpie can gain the education they need about specific health concerns. Good breeders utilize genetic testing of their breeding stock to reduce the likelihood of disease in their puppies.",
            "Training": "The Australian Kelpie has a double coat with a short, dense undercoat. The outer coat is close, each hair straight, hard and lying flat, so that it resists rain. Kelpies need weekly brushing or combing to remove dead hairs, and the occasional bath will keep them clean and looking their best. Otherwise, the Kelpie is a relatively low-maintenance breed.",
            "Nutrition": "Australian Kelpies need a lot of exercise to be their happiest selves. A good jog or long workout combined with the mental exercise of obedience lessons should be done daily. Kelpies prefer to have a job to do (they will try to herd other dogs, pets, even children), but they also have an 'off' switch. They can do a five-mile run, then settle on the couch with the family to watch a movie. Kelpies are not suited to apartment living as they need space for their limitless energy."
        }
    },
    "Australian Shepherd": {
        "url": "https://www.akc.org/dog-breeds/australian-shepherd/",
        "scraped_data": {
            "Health": "Aussies are generally healthy dogs, and a responsible breeder will test breeding stock for health concerns such as hip dysplasia, epilepsy, cataracts and certain forms of cancer. An Aussie's ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and his teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Aussies are generally healthy dogs, and a responsible breeder will test breeding stock for health concerns such as hip dysplasia, epilepsy, cataracts and certain forms of cancer. An Aussie's ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and his teeth should be brushed regularly.",
            "Training": "In general, weekly brushing sessions will keep the Australian Shepherd's waterproof, double-layer coat looking its best. During shedding season, though, more work will be required. During this period an undercoat rake can be used every two or three days to remove the abundant dead hair, followed by a cleanup with the wire brush. Aussies often work and/or play outdoors, so it's not unusual for them to come in dirtier than they left. But unless they've gotten into a particularly messy situation, they require a bath only occasionally. As with all breeds, the Aussie's nails should be trimmed regularly.",
            "Nutrition": "A high-energy, athletic dog, the Aussie needs a great deal of exercise on a daily basis. At minimum, he should have a large, fenced-in yard to run around in for at least an hour or two daily. Aussies bond closely with their owners and love to accompany them on long walks'or, better yet, hikes. Once an Aussie leaves puppyhood behind, and his skeletal system is fully formed, he can make a great running companion. The best course, however, is to give the Aussie a job, whether that is herding livestock, shepherding children, or competing in canine events such as obedience, herding or agility trials, or dock diving."
        }
    },
    "Australian Stumpy Tail Cattle Dog": {
        "url": "https://www.akc.org/dog-breeds/australian-stumpy-tail-cattle-dog/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "Although a healthy breed - it is recommemded that all Stumpy's be screens for hip dysplasia, elbow dysplasia, Progress Retinal Aprophy, Rod Cone Atrophy, and all pups should be BAER tested as this breed carries deafness, and Primary Lens Luxation. A simply cheek swab for genetic testing for eye diseases sent to an approve lab will help assure this breed stays healthy in the future.",
            "Training": "Requirements for grooming are minimal. Weekly brushing with a slicker brush and a small tooth comb will keep the coat in good condition. Bathing should be done when the dog gets dirty. Facial whiskers need not be removed. Toe nails should be kept short and dull. The toe nails can grow quickly and become very sharp.",
            "Nutrition": "The \"Stumpy\" has a very high energy level and therefore needs daily exercise, a secure place to run, and mind stimulating work. With a high level of stamina, this breed can work stock all day in adverse condition for which it was developed. Hiking, backpacking, and obedience training is essential for healthy body and mind for the lifetime of the dog."
        }
    },
    "Australian Terrier": {
        "url": "https://www.akc.org/dog-breeds/australian-terrier/",
        "scraped_data": {
            "Health": "In general, the Australian Terrier is a sturdy breed with few health problems. A responsible breeder will test breeding stock for health conditions such as luxating patella (a dislocated kneecap called a 'trick knee' in humans) and Legg-Calve-Perthes disease, a malformation of the hip joint that manifests early and can be corrected with surgery. Some dogs can develop itchy skin conditions, and flea control is essential. As with all breeds, the ears should be checked regularly, and the teeth should be brushed often.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "Thyroid Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "In general, the Australian Terrier is a sturdy breed with few health problems. A responsible breeder will test breeding stock for health conditions such as luxating patella (a dislocated kneecap called a 'trick knee' in humans) and Legg-Calve-Perthes disease, a malformation of the hip joint that manifests early and can be corrected with surgery. Some dogs can develop itchy skin conditions, and flea control is essential. As with all breeds, the ears should be checked regularly, and the teeth should be brushed often.",
            "Training": "The Australian Terrier's harsh, weatherproof, double coat does a good job of repelling dirt and mud, and is very easy to maintain. A quick brushing once a week is usually enough to keep it in fine shape. The long hairs that grow in front of and between the eyes can irritate the eyes if left unchecked; fortunately, they are easily plucked out with tweezers or fingers. An Aussie should have a bath only when needed. Shampooing softens the harsh coat, rendering its dirt-shedding capability ineffective, and too much bathing can also make the Aussie's skin dry and flaky. As with all breeds, the Aussie's nails should be trimmed regularly.",
            "Nutrition": "Terriers in general have a high energy level, and the Aussie is no exception. The breed is very active and requires regular exercise to keep from becoming bored and unhappy. Boredom leads to undesirable behavior. Daily play sessions, indoors or out, will keep an Aussie happy and well adjusted. However, these sessions must take place is a securely fenced yard, and when on walks or hikes, an Aussie must be on a leash. Aussies should never run loose'their instinct to hunt is very strong, and they might not be able to resist running off to chase a cat or squirrel, and might pursue their prey so far from home that they can't find their way back."
        }
    },
    "Azawakh": {
        "url": "https://www.akc.org/dog-breeds/azawakh/",
        "scraped_data": {
            "Health": "Azawakhs are generally health dogs, and a responsible breeder will screen breeding stock for health issues such as hypothyroidism, seizures, cardiac problems, and autoimmune-mediated disease. Azawakhs are slender, elegant dogs whose thin skin naturally allows their bone structure and muscle to show through; owners should learn what an Azawakh in good weight and condition looks like.",
            "Recommended Health Tests": [
                "No recommended health tests"
            ],
            "Grooming": null,
            "Exercise": "Azawakhs are generally health dogs, and a responsible breeder will screen breeding stock for health issues such as hypothyroidism, seizures, cardiac problems, and autoimmune-mediated disease. Azawakhs are slender, elegant dogs whose thin skin naturally allows their bone structure and muscle to show through; owners should learn what an Azawakh in good weight and condition looks like.",
            "Training": "The Azawakh's short, fine coat requires minimal upkeep. A weekly once-over with a soft bristle brush, a rubber grooming mitt or tool, or a hound glove is usually all that's needed to keep the coat in good condition. Azawakhs don't have a doggy odor, so frequent bathing isn't necessary. Even if the hound does find his way into a mud puddle, a bath may not be required'waiting for the mud to dry and then brushing it away may do the trick. As with all breeds, the Azawakh's nails should be trimmed regularly, as overly long nails are painful and can impede the dog's gait.",
            "Nutrition": "The Azawakh is an active breed, requiring daily exercise to keep both mind and body healthy. Adult Azawakhs can make great running companions. Failing that, a daily half-hour play session in a well-fenced field, park, or yard will keep the hound happy and healthy. However, an Azawakh left alone in the yard will not self-exercise. He is more likely to get the activity he needs in the presence of the owner or another dog."
        }
    },
    "Barbado da Terceira": {
        "url": "https://www.akc.org/dog-breeds/barbado-da-terceira/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "The Barbado da Terceira is a robust and athletic breed with a muscular physique that facilitates speed and endurance. Its double coat allows it to adapt to diverse weather conditions, and its strong bones and joints make it well-suited for an active lifestyle and various sports, such as agility, herding, and flyball.\nHip problems are uncommon in BDTs; however, no dog breed can claim to have perfect hips. Breeders are dedicated to continuously improving hip health through Pennhip testing of all dogs in the US. Although DNA tests show that some BDTs are carriers of MDR-1 and CDDY, there have been no reported cases of adverse effects from these conditions.",
            "Training": "Bath every two months or as needed. Frequent bathing removes essential skin oils.  Should be brushed weekly or biweekly to prevent matting and remove debris. Summer trimming is unnecessary.  Shaving should be avoided, if possible, as it can permanently damage the outer coat. If desired, the hair may be scissored down to 1-1.5 inches, following the natural lines of the dog's shape. The muzzle, beard, and top of the head may be kept longer, with some strands going over the eyes, as long as the dog can still see. Hair on the muzzle should be rounded.  Nails, including dew claws, should be checked and trimmed every few weeks. Ears should be checked weekly and cleaned. Teeth should be regularly brushed.",
            "Nutrition": "The intelligent and athletic Barbado da Terceira must have daily exercise, both mental and physical, to stave off problem behaviors.  \n\nBDTs are happiest when they have a cow to herd, but if these are not available, a ball, a squirrel, or a paper bag blowing in the wind will do. They willingly walk, hike, or jog with their human. Agility courses and herding courses, if available, are also great substitutes for those not living on a farm. \n\nBDTs are giddy and vocal when playing with each other. Other breeds may be intimidated by the BTDs earnest play and herding tendencies.\n\nA BDT rarely leaves its owner's side and doesn't typically need to learn recall due to its protective nature and instincts. Any fence built to contain a BDT should be 8 feet tall and should lack rungs to prevent climbing."
        }
    },
    "Barbet": {
        "url": "https://www.akc.org/dog-breeds/barbet/",
        "scraped_data": {
            "Health": "The Barbet is solidly built with adequate bone to perform his tasks as a true sporting dog, and as such is sturdy, with a moderately sized and constructed frame. Given the small genetic pool from which the Barbet draws, it is a surprisingly healthy breed thanks to wise, cautious selection by breeders. Responsible breeders screen for health conditions such as as hip and elbo dysplasia, progressive retinal atrophy (PRA), seizure disorders and allergies.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Barbet is solidly built with adequate bone to perform his tasks as a true sporting dog, and as such is sturdy, with a moderately sized and constructed frame. Given the small genetic pool from which the Barbet draws, it is a surprisingly healthy breed thanks to wise, cautious selection by breeders. Responsible breeders screen for health conditions such as as hip and elbo dysplasia, progressive retinal atrophy (PRA), seizure disorders and allergies.",
            "Training": "Grooming can be a wonderful bonding experience for you and your dog. The proper grooming of a Barbet starts with a full brush-out, a comb through to the skin, and a good bath. An after-bath blow drying will straighten the hair and make a fluff ball ready for a scissor trim. An all-over trim to approximately 3 to 5 inches in length to show the shape of the body is preferred, while the head, ears and tail remain longer. For the purpose of showing, the hair on the head must reach the muzzle. After the trim, the Barbet must be wet down and left to air-dry to regain his natural curls.     A Barbet's strong, fast-growing nails should be trimmed regularly with a nail clipper or grinder to avoid overgrowth, splitting and cracking. Ears should be checked regularly to avoid a buildup of wax and debris, which can result in infection. Teeth should be brushed regularly.",
            "Nutrition": "Bred as a marsh/swamp game retriever, the Barbet is an agile athlete and loyal partner in any activity, especially if it involves water. He actually has webbed paws specifically for swimming. Besides swimming, other options for exercise include play time in the backyard, preferably fenced, or taken for walks several times a day. Exercise can also come in the form of indoor activities, like hide-and-seek, chasing a ball rolled along the floor, or teaching them new tricks. The Barbet enjoys plenty of playtime with dogs and people, but is then content to lounge nearby indoors. He is happiest when well socialized and prefers not to spend too many hours alone."
        }
    },
    "Basenji": {
        "url": "https://www.akc.org/dog-breeds/basenji/",
        "scraped_data": {
            "Health": "Basenji are generally healthy dogs, and responsible breeders screen for health disorders such as hypothyroidism, a type of inflammatory bowel disease called IPSID and canine hip dysplasia. Gene tests are available to identify carriers of Fanconi syndrome, a kidney disorder, as well as progressive retinal atrophy, or PRA; such tests allow breeders to plan breedings that will not produce those diseases. As with all breeds, a Basenji's ears should be checked regularly, and the teeth should be brushed often.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Thyroid Evaluation",
                "Progressive Retinal Atrophy (Basenji) (PRA) - DNA Test",
                "Fanconi's Syndrome, Paradoxic glucosuria - DNA Test",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Basenji are generally healthy dogs, and responsible breeders screen for health disorders such as hypothyroidism, a type of inflammatory bowel disease called IPSID and canine hip dysplasia. Gene tests are available to identify carriers of Fanconi syndrome, a kidney disorder, as well as progressive retinal atrophy, or PRA; such tests allow breeders to plan breedings that will not produce those diseases. As with all breeds, a Basenji's ears should be checked regularly, and the teeth should be brushed often.",
            "Training": "Basenjis are fastidious creatures. Their short coat is a breeze to take care of, generally requiring no more than a quick once-over with a soft-bristle brush, a rubber grooming mitt or tool, or a hound glove every week. Brushing distributes skin oils throughout the coat to help keep it healthy and looking its best. Basenjis don't have a 'doggy' smell, and they usually don't need to be bathed unless they get into something particularly messy. As with all breeds, the Basenji's nails should be trimmed regularly, because overly long nails can cause the dog pain as well as problems walking and running.",
            "Nutrition": "Basenjis are energetic, inquisitive, and very active. They require lots of regular exercise to keep them from becoming bored. Boredom can lead to destructive behavior. Long play sessions in a well-fenced yard or securely on lead are required. A Basenji should never run loose, as the breed's instinct to hunt is very strong, and the dog might not be able to resist the urge to run off on a chase. Giving the dog a structured outlet for those instincts and that pent-up energy can help immensely; many Basenjis enjoy, and excel at, canine sports such as lure coursing, tracking, and obedience and agility competitions."
        }
    },
    "Basset Fauve de Bretagne": {
        "url": "https://www.akc.org/dog-breeds/basset-fauve-de-bretagne/",
        "scraped_data": {
            "Health": "The Basset Fauve de Bretagne is a relatively healthy dog, and responsible breeders screen their stock for health concerns such as progressive retinal atrophy (PRA), epilepsy, cardiomyopathies, skin allergies and age-related thyroid issues. A gene test for primary open angle glaucoma is now available, meaning breeders are able to identify carriers and avoid producing this eye anomaly. The vast majority of Fauves are very healthy and enjoy longevity, with many living to be 16 plus years old. Working with a responsible breeder can help those wishing to own a Fauve to gain the knowledge they need about specific health concerns within the breed. Good breeders utilize genetic testing of their breeding dogs to reduce the likelihood of problems with their puppies.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Basset Fauve de Bretagne is a relatively healthy dog, and responsible breeders screen their stock for health concerns such as progressive retinal atrophy (PRA), epilepsy, cardiomyopathies, skin allergies and age-related thyroid issues. A gene test for primary open angle glaucoma is now available, meaning breeders are able to identify carriers and avoid producing this eye anomaly. The vast majority of Fauves are very healthy and enjoy longevity, with many living to be 16 plus years old. Working with a responsible breeder can help those wishing to own a Fauve to gain the knowledge they need about specific health concerns within the breed. Good breeders utilize genetic testing of their breeding dogs to reduce the likelihood of problems with their puppies.",
            "Training": "The Basset Fauve de Betagne is almost a 'wash-and-wear' dog, with a coarse, wiry coat that repels dirt and resists matting. Some dogs have more coat than others. Longhaired dogs can be hand-stripped. All require grooming weekly with a fine-toothed comb, followed by a stiff brush. Shedding is seasonal. Nails should be trimmed regularly to avoid overgrowth and splitting. Teeth should be brushed and ears checked regularly.",
            "Nutrition": "Basset Fauves are energetic and love to play. Regular walks need to be on a leash as they can run off and follow their nose at a moment's notice. Areas for exercise and play, such as a backyard, should be fenced for the same reasons. Exercise can also come in the form of indoor activities, like hide-and-seek, chasing a ball rolled along the floor, or teaching them new tricks. Training for dog sports like agility, obedience and rally can also be a great way to give your dog exercise."
        }
    },
    "Basset Hound": {
        "url": "https://www.akc.org/dog-breeds/basset-hound/",
        "scraped_data": {
            "Health": "Because of the Basset's ears are long and droopy, it's important to check them frequently to ensure that air circulation hasn't led to an infection. Shaking the head or scratching at the ears may indicate the need for a vet visit. Responsible breeders check for health conditions such as hip dysplasia, elbow dysplasia, glaucoma, hypothyroidism, bleeding disorders, and luxating patella, a dislocated kneecap once called a 'trick knee' in humans. Brushing your dog's teeth with specially formulated canine toothpaste at least twice a week is also a vital part of Basset health care.",
            "Recommended Health Tests": [
                "Lafora Disease - DNA Test",
                "Mucopolysaccharidosis I (MPS I) - DNA Test",
                "Thrombopathia (Basset Hound) - DNA Test",
                "Primary Open Angle Glaucoma (Basset Hound) (POAG) - DNA Test",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Because of the Basset's ears are long and droopy, it's important to check them frequently to ensure that air circulation hasn't led to an infection. Shaking the head or scratching at the ears may indicate the need for a vet visit. Responsible breeders check for health conditions such as hip dysplasia, elbow dysplasia, glaucoma, hypothyroidism, bleeding disorders, and luxating patella, a dislocated kneecap once called a 'trick knee' in humans. Brushing your dog's teeth with specially formulated canine toothpaste at least twice a week is also a vital part of Basset health care.",
            "Training": "Although it might seem that with his short, smooth hair the Basset Hound won't need any grooming, that's not quite the case. Regular grooming sessions are an important part of keeping the breed healthy and happy. The Basset's short hair can shed profusely. Shedding can be kept under control by gently going over the dog at least once a week with a soft brush or a shedding tool. As well as removing hair that is ready to shed, grooming is like an all-body massage that benefits his skin and overall health. The Basset will also need his nails trimmed regularly, and an occasional bath will help to keep his coat clean and shiny.",
            "Nutrition": "Basset Hounds are not as active as some breeds, but they do require regular, moderate exercise. Usually a daily walk at a moderate pace will fill the bill. Exercise will help to keep the Basset healthy and prevent him from becoming overweight. Since the breed was developed to work in a pack with other dogs, Bassets enjoy canine company on their outings, and the breed can be quite playful. After a walk or play session they'll typically settle down for a comfortable sleep."
        }
    },
    "Bavarian Mountain Scent Hound": {
        "url": "https://www.akc.org/dog-breeds/bavarian-mountain-scent-hound/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "Bavarians are a generally very healthy breed. Responsible breeders screen their stock for health concerns such as hip dysplasia and epilepsy. Good breeders utilize genetic testing of their breeding stock to reduce the likelihood of disease in their puppies.",
            "Training": "The Bavarian requires regular brushing. His coat is dense, close fitting and harsh, with little gloss, and is finer on the head and ears, and harsher and longer on the belly, legs and tail. The breed's strong, fast-growing nails should be trimmed regularly with a nail clipper or grinder to avoid overgrowth, splitting and cracking. Their ears should be checked regularly to avoid a buildup of wax and debris, which can result in infection. Teeth should be brushed regularly.",
            "Nutrition": "Bavarian Mountain Scent Hounds are not suited for city life. They are in regular need of space and exercise. They are also not dogs for the casual hunter. Most are owned and used by foresters and game wardens. If not placed in a working home, the Bavarian will need an abundant amount of physical and mental stimulation to satisfy his high hunting instinct. He is not a kennel dog, but can be trained to sleep and eat there. Space to run and play in an area with a high fence is important, as they have been known to climb fences and dig holes when bored."
        }
    },
    "Beagle": {
        "url": "https://www.akc.org/dog-breeds/beagle/",
        "scraped_data": {
            "Health": "Responsible breeders will screen their breeding stock for health conditions such as hip dysplasia, hypothyroidism, epilepsy, luxating patella (a dislocated kneecap), and eye disorders. As with all breeds, a Beagle's ears should be checked weekly, and the teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Thyroid Evaluation",
                "Musladin-Lueke Syndrome (MLS) - DNA Test",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Responsible breeders will screen their breeding stock for health conditions such as hip dysplasia, hypothyroidism, epilepsy, luxating patella (a dislocated kneecap), and eye disorders. As with all breeds, a Beagle's ears should be checked weekly, and the teeth should be brushed regularly.",
            "Training": "The Beagle has a smooth, dense double coat that gets heavier in the winter, so spring is shedding season. Beagles also shed moderately year-round. Weekly brushing with a medium-bristle brush, a rubber grooming mitt or tool, or a hound glove will remove the loose hair, and promotes new hair growth as well. Beagles don't need to be bathed too often, unless they happen to get into something particularly messy. As with all breeds, the Beagle's nails should be trimmed regularly, because overly long nails can cause the dog pain as well as problems walking and running.",
            "Nutrition": "Beagles are active, energetic dogs who need at least an hour of exercise every day. This doesn't mean just letting them out in the backyard. Beagles were bred to work in packs and are happiest when they have company. A Beagle who is left alone inside or outside for long periods of time will tend to become destructive. This can be avoided if he has a companion (whether human or canine) to play with. Beagles are escape artists, so an exercise area must have a fence at least five feet tall that extends underground to prevent tunneling. Walks must always be taken on a leash, because as a scenthound with a very strong hunting instinct, a Beagle will not be able to resist the urge to run off in pursuit of a compelling scent."
        }
    },
    "Bearded Collie": {
        "url": "https://www.akc.org/dog-breeds/bearded-collie/",
        "scraped_data": {
            "Health": "The Beardie is a sturdy breed, and responsible breeders screen their breeding stock for health conditions such as hip dysplasia, hypothyroidism, autoimmune diseases, allergies, and eye problems. As with all breeds, a Beardie's ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and the teeth brushed daily.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "Thyroid Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Beardie is a sturdy breed, and responsible breeders screen their breeding stock for health conditions such as hip dysplasia, hypothyroidism, autoimmune diseases, allergies, and eye problems. As with all breeds, a Beardie's ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and the teeth brushed daily.",
            "Training": "The Beardie grooming regimen consists of two parts. The first is a daily brushing to remove tangles and foreign matter, which shouldn't take more than five or ten minutes, assuming the dog hasn't gotten into something messy. The second part is a weekly session with a pin rake, brush, comb, and possibly anti-tangle spray to remove dead hair and return the coat to pristine condition. This generally takes a half-hour to an hour. As with all breeds, the Beardie's nails should be trimmed regularly, because overly long nails can cause the dog pain as well as problems walking and running.",
            "Nutrition": "The Bearded Collie is an energetic, boisterous breed that requires a fair amount of outdoor exercise. Unlike many of their owners, Beardies are happy to run and play outside no matter what the weather. They need some sort of activity every day, whether playing ball; a long walk, run, or hike; or just playing in a large, fenced-in yard or other area with a companion, human or canine. And, of course, being bred to herd sheep, Beardies love to participate in athletic events such as herding, rally, agility, and obedience competitions. A busy Beardie is a happy Beardie."
        }
    },
    "Beauceron": {
        "url": "https://www.akc.org/dog-breeds/beauceron/",
        "scraped_data": {
            "Health": "Any large or deep-chested dog may be susceptible to bloat, a sudden and life-threatening stomach condition. Beauceron owners should educate themselves on what symptoms to look for and what to do should it occur. Responsible breeders will screen their breeding stock health conditions such as hip dysplasia, heart disease, eye problems, and allergies. As with all breeds, a Beauceron's ears should be checked regularly, and the teeth should be brushed often.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Any large or deep-chested dog may be susceptible to bloat, a sudden and life-threatening stomach condition. Beauceron owners should educate themselves on what symptoms to look for and what to do should it occur. Responsible breeders will screen their breeding stock health conditions such as hip dysplasia, heart disease, eye problems, and allergies. As with all breeds, a Beauceron's ears should be checked regularly, and the teeth should be brushed often.",
            "Training": "The Beauceron has a short, dense double coat; the soft undercoat is covered by a rough, waterproof outer coat. It doesn't require a lot of grooming, but it does shed. A lot. And even more so twice a year during shedding season. Weekly brushing, daily during shedding season, with a medium-bristle brush, a rubber grooming mitt or tool, or a hound glove will remove the dead hair before it can fall onto the furniture, and it promotes new hair growth as well. As with all breeds, the Beauceron's nails should be trimmed regularly, because overly long nails can cause the dog pain as well as problems walking and running. Don't forget to trim the double dewclaws on the rear legs.",
            "Nutrition": "The Beauceron is a powerful, athletic, and intelligent breed that needs lots of physical and mental challenges. This is not a breed for novice owners. They need a variety of outdoor locations and types of exercise each day and are best suited to an experienced, active owner who can provide the mental and physical activity they need. Although the Beauceron was not bred to gather sheep as other shepherd breeds were, he can be trained to perform in herding events, as well as Schutzhund (protection work) and agility trials and activities such as carting, mushing, and skijoring (pulling a person who is on skis)."
        }
    },
    "Bedlington Terrier": {
        "url": "https://www.akc.org/dog-breeds/bedlington-terrier/",
        "scraped_data": {
            "Health": "The Bedlington is generally a healthy breed, and responsible breeders will screen their breeding stock for health conditions such as hip and elbow dysplasia, hypothyroidism, von Willebrand's disease (a bleeding disorder), thrombopathia, and certain eye issues. As with all breeds, a Bedlington's ears should be checked regularly, and the teeth brushed daily.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "Copper Toxicosis DNA Test",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Bedlington is generally a healthy breed, and responsible breeders will screen their breeding stock for health conditions such as hip and elbow dysplasia, hypothyroidism, von Willebrand's disease (a bleeding disorder), thrombopathia, and certain eye issues. As with all breeds, a Bedlington's ears should be checked regularly, and the teeth brushed daily.",
            "Training": "The crisp, curly coat of the Bedlington Terrier is a mix of soft and harsh, but not wiry, hair. While fastidious owners will be happy to learn that it virtually does not shed at all, it grows very quickly and needs to be clipped every two months. Many owners learn the process, which involves both electric clippers and scissors, while others are happy to take their Bedlington to a groomer. In addition, a Bedlington needs to be brushed and/or combed once or twice a week. As with all breeds, the Bedlington's nails should be trimmed regularly, because overly long nails can cause the dog pain as well as problems walking and running.",
            "Nutrition": "Bedlingtons, like most Terriers, have a fair amount of energy and require regular exercise to stay fit and happy. The breed is energetic, but not rambunctious or mischievous. A Bedlington loves to play fetch or go on a long walk or run, but afterwards he's happy to just curl up on the couch with his family. Despite their lamb-like looks, Bedlingtons were bred to chase small animals, and that's what they do. So they require a fenced-in yard and should be on a leash for all walks. Many Bedlingtons enjoy participating in agility, obedience, tracking, and earthdog competitions."
        }
    },
    "Belgian Laekenois": {
        "url": "https://www.akc.org/dog-breeds/belgian-laekenois/",
        "scraped_data": {
            "Health": "The Belgian Laekenois is a robust, healthy breed. Responsible breeders will screen their breeding stock for various health conditions. As with all breeds, a Belgian Laekenois's ears should be checked regularly for signs of infection, and the teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "Thyroid Evaluation",
                "Dentition Exam",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Belgian Laekenois is a robust, healthy breed. Responsible breeders will screen their breeding stock for various health conditions. As with all breeds, a Belgian Laekenois's ears should be checked regularly for signs of infection, and the teeth should be brushed regularly.",
            "Training": "Beyond regular weekly grooming, the occasional bath will keep your Belgian Laekenois clean and looking his best. Grooming can be a wonderful bonding experience for you and your dog. The Laekenois' strong, fast-growing nails should be trimmed regularly with a nail clipper or grinder to avoid overgrowth, splitting and cracking. Their ears should be checked regularly to avoid a buildup of wax and debris, which can result in an infection. Teeth should be brushed regularly.",
            "Nutrition": "The ideal owner will understand that the Belgian Laekenois is not going to be happy sitting around nor can he be expected to live alone in the yard. Eager to please, Laekenois want to be with their humans, and need an active lifestyle and plenty of employment to be happy. When the new puppy arrives, it's important to get him socialized early, with frequent and positive meet-and-greet sessions, as these working dogs are typically reserved with strangers."
        }
    },
    "Belgian Malinois": {
        "url": "https://www.akc.org/dog-breeds/belgian-malinois/",
        "scraped_data": {
            "Health": "The Malinois is generally a healthy breed, and a responsible breeder will screen breeding stock for health conditions such as hip and elbow dysplasia and certain eye problems. As with all breeds, the ears should be checked regularly for signs of infection, and the teeth should be brushed frequently.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Malinois is generally a healthy breed, and a responsible breeder will screen breeding stock for health conditions such as hip and elbow dysplasia and certain eye problems. As with all breeds, the ears should be checked regularly for signs of infection, and the teeth should be brushed frequently.",
            "Training": "The short, waterproof coat of the Malinois is quite easy to take care of. Occasional brushing with a medium-bristle brush, a rubber grooming mitt or tool, or a hound glove will keep the dog looking his best, and promotes new hair growth and distributes skin oils throughout the coat as well. Malinois do shed twice a year; during these periods, a daily once-over with a slicker brush will help to remove the loose hair. As with all breeds, the nails should be trimmed regularly, as overly long nails can cause the dog pain as well as problems walking and running.",
            "Nutrition": "Highly intelligent, athletic, and muscular, and exceedingly devoted, the Malinois need to be actively engaged with his owner, both mentally and physically. This is not a dog who can be left in the backyard, and daily walks are not enough, either. Exercise, and plenty of it, preferably side by side with his owner, is paramount to the breed's happiness. To deprive a Malinois of activity and human companionship is to deprive him of his very reasons for being. Malinois make great running, hiking, and biking companions, and they excel at agility, tracking, herding, obedience, and Schutzhund (protection) competitions."
        }
    },
    "Belgian Sheepdog": {
        "url": "https://www.akc.org/dog-breeds/belgian-sheepdog/",
        "scraped_data": {
            "Health": "The Belgian Sheepdog is a robust, healthy breed. Responsible breeders will screen their breeding stock for health conditions such as epilepsy, elbow and hip dysplasia, eye issues such as progressive retinal atrophy and cataracts, and certain cancers. Should the need for surgery arise, note that Belgians are particularly sensitive to anesthesia. As with all breeds, a Belgian's ears should be checked regularly for signs of infection, and the teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Belgian Sheepdog is a robust, healthy breed. Responsible breeders will screen their breeding stock for health conditions such as epilepsy, elbow and hip dysplasia, eye issues such as progressive retinal atrophy and cataracts, and certain cancers. Should the need for surgery arise, note that Belgians are particularly sensitive to anesthesia. As with all breeds, a Belgian's ears should be checked regularly for signs of infection, and the teeth should be brushed regularly.",
            "Training": "The Belgian Sheepdog's double-layer coat, consisting of a dense undercoat and a harder outer coat, is quite easy to take care of ' as long as it's not shedding season. For most of the year, all a Belgian requires is a weekly brushing. Baths can be infrequent unless the dog gets into something messy. At least once a year, though, Belgians shed heavily. When this happens, a thorough brushing every day is required to remove the surprisingly large amount of dead hair. As with all breeds, the Belgian's nails should be trimmed regularly.",
            "Nutrition": "Like so many of the Herding breeds, Belgian Sheepdogs require a good amount of exercise every day. And because the Belgian is a sensitive soul who craves human companionship, just letting him out in the backyard for a couple of hours is not enough. Owners should expect to participate in daily exercise sessions with their Belgians. This might mean playing with a ball or going for a long run, or it could also mean training for and participating in obedience, agility, tracking, or herding competitions, or canine sports such as flyball."
        }
    },
    "Belgian Tervuren": {
        "url": "https://www.akc.org/dog-breeds/belgian-tervuren/",
        "scraped_data": {
            "Health": "The Belgian Tervuren is typically a healthy breed, and a responsible breeder will screen breeding stock for health conditions such as hip dysplasia, a malformation of the hip joint; elbow dysplasia; progressive retinal atrophy, which causes vision loss and blindness; and epilepsy. As with all breeds, a Terv's ears should be checked regularly for signs of infection, and the teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "Thyroid Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Belgian Tervuren is typically a healthy breed, and a responsible breeder will screen breeding stock for health conditions such as hip dysplasia, a malformation of the hip joint; elbow dysplasia; progressive retinal atrophy, which causes vision loss and blindness; and epilepsy. As with all breeds, a Terv's ears should be checked regularly for signs of infection, and the teeth should be brushed regularly.",
            "Training": "The Belgian Tervuren has a double-layer coat, with a dense, protective undercoat covered by a harsher outer coat. For most of the year, all that's required to groom him is a quick but thorough brushing once or twice a week with a pin brush and a slicker brush. During shedding season, however, which occurs at least once a year, these sessions expand to 15 or 20 minutes and may become a bit more frequent, and a rake is added to the toolkit to help remove all the dead hair. As with all breeds, the Terv's nails should be trimmed regularly.",
            "Nutrition": "The Belgian Tervuren's AKC standard says the breed is 'always in motion, seemingly never tiring '.' So, yes, this is a dog who needs a lot of exercise every day. Lots of hard work and challenging play'preferably with his owner rather than by himself'are a Terv's idea of heaven. This is not a breed for everyone, and a Terv owner should expect to spend a good amount of active quality time with his canine friend. Its strong herding instinct and quick intelligence make the breed suitable for any number of activities, including herding, agility, and obedience competitions, mushing and Schutzhund (protection) activities."
        }
    },
    "Bergamasco Sheepdog": {
        "url": "https://www.akc.org/dog-breeds/bergamasco-sheepdog/",
        "scraped_data": {
            "Health": "Bergamascos are generally a healthy breed. Like all breeds there may be some health issues. Some dogs may be faced with these health challenges in their lives, but the majority of Bergamascos are healthy dogs.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "Degenerative Myelopathy (Common Variant) (DM) - DNA Test"
            ],
            "Grooming": null,
            "Exercise": "Bergamascos are generally a healthy breed. Like all breeds there may be some health issues. Some dogs may be faced with these health challenges in their lives, but the majority of Bergamascos are healthy dogs.",
            "Training": "The coat of an adult Bergamasco is basically maintenance-free. It's made up of three types of hair, called 'dog,'  'goat,' and 'wool.' Goat and wool hairs don't start to appear until the dog is a year old. When they do, the coat must be ripped into mats, a process that can take a few hours or a few evenings. But once it's done, it's done. A Bergamasco doesn't shed, doesn't need to be brushed, and doesn't need to be bathed more than two or three times a year. Because the coat aids in thermoregulation, a Bergamasco should never be shaved down. As with all breeds, the Bergamasco's nails should be trimmed regularly.",
            "Nutrition": "The Bergamasco Sheepdog requires only a moderate amount of exercise every day. Because they bond closely with their owners, this exercise should come in the form of some sort of mutual activity rather than the dog being left alone in the backyard. And while they are generally calm, Bergamascos have a good deal of energy and are happy to join their owners in almost any sort of activity, whether that entails retrieving a ball, going on a brisk walk or hike, or romping together in an open field."
        }
    },
    "Berger Picard": {
        "url": "https://www.akc.org/dog-breeds/berger-picard/",
        "scraped_data": {
            "Health": "Berger Picards are generally a healthy breed. Like all breeds there may be some health issues. Some dogs may be faced with these health challenges in their lives, but the majority of Berger Picards are healthy dogs.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Berger Picards are generally a healthy breed. Like all breeds there may be some health issues. Some dogs may be faced with these health challenges in their lives, but the majority of Berger Picards are healthy dogs.",
            "Training": "The Berger Picard's double coat consists of a soft, dense undercoat for insulation covered by a shaggy, wiry, waterproof topcoat. During shedding season, brushing every day or two with a rake and a slicker brush will remove the dead hair before it ends up on the floor and furniture. The rest of the year, a Picard only needs to be brushed once a month. The breed should be bathed only occasionally, and shampoos formulated for crisp coats are recommended. As with all breeds, the Picard's nails should be trimmed regularly.",
            "Nutrition": "Bred to work in the fields, the Berger Picard is active and athletic, with plenty of stamina and drive. This high-energy breed needs lots of daily exercise and mental stimulation. The Picard must have a good outlet for all his energy, or he may become destructive and unhappy. Owners should expect to go on at least one long walk every day. Picards also make excellent companions on hikes and bike rides, and they enjoy swimming and playing fetch. Many Picards participate in agility, tracking, obedience, Schutzhund (protection), flyball, French ring sport, rally, and herding competitions."
        }
    },
    "Bernese Mountain Dog": {
        "url": "https://www.akc.org/dog-breeds/bernese-mountain-dog/",
        "scraped_data": {
            "Health": "Berners are generally healthy dogs, and responsible breeders will screen their breeding stock for health conditions such as hip and elbow dysplasia, blood disorders, some cancers, and progressive retinal atrophy. All large breeds are susceptible to bloat, a sudden, life-threatening stomach condition. Berner owners should learn what signs to look out for, and what to do should they occur. As with all breeds, a Berner's ears should be checked regularly for signs of infection, and the teeth should be brushed often, using a toothpaste designed for dogs.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "AKC DNA Profile",
                "Degenerative Myelopathy (Common Variant) (DM) - DNA Test",
                "Degenerative Myelopathy (Bernese Mountain Dog Variant) (DM) - DNA Test",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Berners are generally healthy dogs, and responsible breeders will screen their breeding stock for health conditions such as hip and elbow dysplasia, blood disorders, some cancers, and progressive retinal atrophy. All large breeds are susceptible to bloat, a sudden, life-threatening stomach condition. Berner owners should learn what signs to look out for, and what to do should they occur. As with all breeds, a Berner's ears should be checked regularly for signs of infection, and the teeth should be brushed often, using a toothpaste designed for dogs.",
            "Training": "The Bernese Mountain Dog has a double coat, with a longer outer coat and a wooly undercoat. Berners shed a fair amount, even more so during shedding season, which occurs twice a year. Weekly brushing'daily during shedding season'will help to remove loose hair and keep the dog looking his best. Any tangles can be worked out with a slicker brush or metal comb. As with all breeds, the nails should be trimmed regularly, as overly long nails can cause the dog pain and structural problems.",
            "Nutrition": "Bernese Mountain Dogs need at least a half-hour of moderate exercise every day to stay healthy and happy. While they are definitely meant to live indoors with their human family, Berners enjoy outdoor activities and make great companions on long walks or hikes. Outdoorsy owners often take their canine companions camping and backpacking. Berners enjoy pulling young children in a cart, and some even participate in carting and drafting competitions. Other canine sports in which Berners participate and excel include agility, herding, obedience, rally, and tracking."
        }
    },
    "Bichon Frise": {
        "url": "https://www.akc.org/dog-breeds/bichon-frise/",
        "scraped_data": {
            "Health": "Bichons are generally healthy dogs, and a responsible breeder will screen breeding stock for health conditions such as allergies, bladder infections, luxating patella, and cataracts and other eye diseases. Bichons may experience early tooth loss or complications from gum infection if dental care and regular tooth brushing are not a priority. To avoid ear infections, regular ear cleaning is recommended.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "Hip Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Bichons are generally healthy dogs, and a responsible breeder will screen breeding stock for health conditions such as allergies, bladder infections, luxating patella, and cataracts and other eye diseases. Bichons may experience early tooth loss or complications from gum infection if dental care and regular tooth brushing are not a priority. To avoid ear infections, regular ear cleaning is recommended.",
            "Training": "Bichons should be brushed at least two or three times a week, but every day is best. They need a bath and a clipping at least once a month. Owners who show their Bichons learn to do this, but most pet owners take their Bichon to the groomer every four to six weeks. The Bichon is considered to be relatively hypoallergenic, as the breed sheds very little because the shed hair is caught up in the undercoat. That shed hair has to be brushed out to prevent mats from forming. As with all breeds, the Bichon's nails should be trimmed regularly as well.",
            "Nutrition": "The Bichon is classified as 'somewhat active,' but that's an average. Long stretches of calm are interspersed with brief bursts of high activity, often just running through the house or around the yard. Daily play sessions, in addition to walks, are required. Another dog can be a fine exercise companion, but the Bichon will still need quality playtime with his owner. A fenced-in backyard is a good idea; Bichons are surprisingly fast, and if one makes a dash for freedom, he may be difficult to catch or to call back to you. Many Bichons enjoy participating in obedience, agility, and rally competitions."
        }
    },
    "Biewer Terrier": {
        "url": "https://www.akc.org/dog-breeds/biewer-terrier/",
        "scraped_data": {
            "Health": "Like all breeds, there may be some health issues. Some dogs may be faced with these health challenges in their lives, but the majority of Biewer Terriers are healthy dogs. Sensitive GI systems are common in the Biewer Terrier, so they may have an occasional soft or discolored stool. Although not life-threatening, if your dog has persistent problems with diarrhea or discolored stools, you should take him/her to the vet immediately. The Biewer Terrier is a relatively healthy dog, with no known excessive issues. That being said, we recommend the following tests for dogs before breeding.",
            "Recommended Health Tests": [
                "Eye Examination by a board Certified ACVO Ophthalmologist",
                "Primary Lens Luxation (PLL) - DNA Test",
                "Progressive Retinal Atrophy, PRCD (PRA-prcd, PRCD) - DNA Test"
            ],
            "Grooming": null,
            "Exercise": "Like all breeds, there may be some health issues. Some dogs may be faced with these health challenges in their lives, but the majority of Biewer Terriers are healthy dogs. Sensitive GI systems are common in the Biewer Terrier, so they may have an occasional soft or discolored stool. Although not life-threatening, if your dog has persistent problems with diarrhea or discolored stools, you should take him/her to the vet immediately. The Biewer Terrier is a relatively healthy dog, with no known excessive issues. That being said, we recommend the following tests for dogs before breeding.",
            "Training": "The Biewer Terrier has a long coat that requires daily brushing. There is minimal matting with the silkier coat, but the soft coats may get some mats. If you choose to keep your Biewer in a short coat, minimal grooming is needed. Good-quality products are recommended to keep the coat in its soft, silky condition.     Grooming can be a wonderful bonding experience for you and your dog. Beyond regular brushing, the occasional bath will keep them clean and looking their best, again using good quality products. Their nails should be trimmed regularly with a nail clipper or grinder to avoid overgrowth, splitting and cracking. Their ears should be checked regularly to avoid a buildup of wax and debris, which can result in an infection. Teeth should be brushed regularly.",
            "Nutrition": "The Biewer Terrier is a rather mellow, easy-going dog. Their playful attitudes provide them with a natural means of self-exercising, along with the time spent playing with their human families. Indoor activities could include hide-and-seek, chasing a ball rolled along the floor, or teaching them new tricks. Biewers are also excellent on walks, quite agile and love to go on outings. If you live in an apartment, even short walks in the hallways can give your dog some exercise, especially during inclement weather."
        }
    },
    "Black and Tan Coonhound": {
        "url": "https://www.akc.org/dog-breeds/black-and-tan-coonhound/",
        "scraped_data": {
            "Health": "The Black and Tan is typically a sturdy breed with few health problems, and a responsible breeder will screen breeding stock for health conditions such as hip dysplasia, cataracts, and thyroid issues. The Black and Tan's ears should be checked weekly for any signs of infection. As with all breeds, the teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Black and Tan is typically a sturdy breed with few health problems, and a responsible breeder will screen breeding stock for health conditions such as hip dysplasia, cataracts, and thyroid issues. The Black and Tan's ears should be checked weekly for any signs of infection. As with all breeds, the teeth should be brushed regularly.",
            "Training": "The Black and Tan Coonhound has a short, dense coat that is shed once or twice a year. Weekly brushing with a medium-bristle brush, a rubber grooming mitt or tool, or a hound glove will remove the dead hair before it can fall onto the furniture. Grooming also promotes new hair growth and distributes skin oils throughout the coat to keep it healthy. Black and Tans should be bathed occasionally to keep them from developing a doggy odor. As with all breeds, the Black and Tan's nails should be trimmed regularly, because overly long nails can cause the dog pain as well as problems walking and running.",
            "Nutrition": "Black and Tan Coonhounds require a moderate amount of exercise every day, whether it's a play session in the yard or a long walk. Of course, these hounds were bred to hunt and have a very strong instinct to chase after any small animal they smell, so the yard has to have a tall, solid fence, and the walk has to be on a leash. An obvious option for exercise is, of course, a hunting trip, and not just for raccoons'the Black and Tan can be trained to help out hunting just about any kind of game, from squirrels to deer, if local ordinances permit. And, as one might expect, Black and Tans also enjoy participating in coonhound field events."
        }
    },
    "Black Russian Terrier": {
        "url": "https://www.akc.org/dog-breeds/black-russian-terrier/",
        "scraped_data": {
            "Health": "The Black Russian Terrier is typically a healthy breed, and a responsible breeder will screen breeding stock for health conditions such as allergies, urinary tract stones, hip and elbow dysplasia, and progressive retinal atrophy, which can cause vision loss and blindness. As with all breeds, a Black Russian Terrier's ears should be checked regularly, and the teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "Juvenile Laryngeal Paralysis & Polyneuropathy (JLPP) - DNA Test",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Black Russian Terrier is typically a healthy breed, and a responsible breeder will screen breeding stock for health conditions such as allergies, urinary tract stones, hip and elbow dysplasia, and progressive retinal atrophy, which can cause vision loss and blindness. As with all breeds, a Black Russian Terrier's ears should be checked regularly, and the teeth should be brushed regularly.",
            "Training": "The Black Russian Terrier's tousled double coat'a thick, soft undercoat covered by a coarse, protective outer coat'needs regular maintenance to prevent mats from forming, with a thorough brushing once or twice a week. The owner will need to learn to scissor around the face, especially his beard and mustache, to keep him looking his best, or rely on a professional groomer to do the job. A trim with clippers every few months can be done by a groomer, but many owners learn how to do it themselves. As with all breeds, the BRT's nails should be trimmed regularly.",
            "Nutrition": "The Black Russian Terrier needs at least 30 or 40 minutes of exercise every day. He is eager to take part in brisk walks, long runs, bike rides, swims, and hikes with his owner. In the backyard, he and his owner can play with a ball or a flying disc. A BRT who doesn't get enough exercise will become unhappy and destructive, and one who doesn't spend enough time with his human family can develop aggressive tendencies. Many BRTs excel at canine sports such as obedience, agility, rally, and Schutzhund (protection) competitions."
        }
    },
    "Bloodhound": {
        "url": "https://www.akc.org/dog-breeds/bloodhound/",
        "scraped_data": {
            "Health": "Like other large, deep-chested dogs, Bloodhounds can experience bloat. Bloodhound owners should educate themselves to recognize the symptoms of this life-threatening condition, and know what to do should it happen. Bloodhounds are notorious for eating anything and everything, which can often lead to vet visits. The Bloodhound's low-hanging ears should be checked daily for any sign of infection. In addition, check the Bloodhound's skin wrinkles daily for odor or irritation, and if needed wipe with a warm, wet cloth and then dry thoroughly. As with all breeds, a Bloodhound's teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "Cardiac Exam"
            ],
            "Grooming": null,
            "Exercise": "Like other large, deep-chested dogs, Bloodhounds can experience bloat. Bloodhound owners should educate themselves to recognize the symptoms of this life-threatening condition, and know what to do should it happen. Bloodhounds are notorious for eating anything and everything, which can often lead to vet visits. The Bloodhound's low-hanging ears should be checked daily for any sign of infection. In addition, check the Bloodhound's skin wrinkles daily for odor or irritation, and if needed wipe with a warm, wet cloth and then dry thoroughly. As with all breeds, a Bloodhound's teeth should be brushed regularly.",
            "Training": "The Bloodhound has a short, dense coat that is shed once or twice a year. Weekly brushing with a medium-bristle brush, a rubber grooming mitt or tool, or a hound glove will remove the dead hair before it can fall onto the furniture. Brushing also promotes new hair growth and distributes skin oils throughout the coat to keep it healthy. Bloodhounds should be bathed regularly to keep them from developing a doggy odor. As with all breeds, the Bloodhound's nails should be trimmed regularly.",
            "Nutrition": "The popular misconception is that Bloodhounds spend their days lazing on the front porch. The truth is that the Bloodhound, who was bred to follow a scent for hours on end, is an active dog who requires daily exercise. He will benefit from long daily walks'always on a leash, as he may not respond to commands if he has found a scent to follow. Additional exercise time can come in the backyard, which must be securely fenced because Bloodhounds are great diggers and escape artists."
        }
    },
    "Blue Picardy Spaniel": {
        "url": "https://www.akc.org/dog-breeds/blue-picardy-spaniel/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "Blue Picardy Spaniels are generally healthy dogs. Responsible breeders screen their breeding stock for health concerns such as elbow and hip dysplasia .",
            "Training": "Having a moderate length coat, regular weekly brushing is required to maintain the soft texture and avoid matting.  A monthly bath, nail trim and regular tooth brushing will keep your Blue healthy and looking great.  As Blues have long ears -keeping them clean and dry will prevent any ear infections.  A good pin brush and a comb will work on their coats.",
            "Nutrition": "A vigorous walk, good run or game of fetch for 20 minutes twice a day is recommended.  A fenced yard is recommended as they are hunting dogs and may leave your property to follow scent.  A leash is recommended for the same reason-remember they are hunting dogs and have prey drive."
        }
    },
    "Bluetick Coonhound": {
        "url": "https://www.akc.org/dog-breeds/bluetick-coonhound/",
        "scraped_data": {
            "Health": "The Bluetick Coonhound is generally a healthy breed. Any deep-chested dog may be susceptible to bloat, a sudden and life-threatening condition where the stomach distends and can also twist, cutting off blood supply to organs. Owners should educate themselves as to the symptoms that indicate bloat is occurring and what to do if so. The Bluetick's low-hanging ears should be checked daily for any signs of infection. As with all breeds, the teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "No recommended health tests"
            ],
            "Grooming": null,
            "Exercise": "The Bluetick Coonhound is generally a healthy breed. Any deep-chested dog may be susceptible to bloat, a sudden and life-threatening condition where the stomach distends and can also twist, cutting off blood supply to organs. Owners should educate themselves as to the symptoms that indicate bloat is occurring and what to do if so. The Bluetick's low-hanging ears should be checked daily for any signs of infection. As with all breeds, the teeth should be brushed regularly.",
            "Training": "The Bluetick Coonhound has a short, glossy coat that sheds only moderately. Weekly brushing with a medium-bristle brush, a rubber grooming mitt, or a hound glove will help to remove loose hairs and keep him looking his best. In general, Blueticks require only an occasional bath, unless they've gotten into something especially messy. As with all breeds, the Bluetick's nails should be trimmed regularly, as overly long nails can cause the dog pain as well as problems walking and running.",
            "Nutrition": "Blueticks are bred as hunting dogs and benefit from getting plenty of exercise, although they also enjoy time spent snoozing at their owner's feet. They will enjoy play sessions with their owner in a securely fenced yard, or long walks on a leash'remember that he is a scent hound with a strong prey drive. In addition to hunting and field trials, canine sports like agility and tracking are good outlets into which to channel the Bluetick's energy."
        }
    },
    "Boerboel": {
        "url": "https://www.akc.org/dog-breeds/boerboel/",
        "scraped_data": {
            "Health": "The Boerboel is typically a healthy breed, and a responsible breeder will screen breeding stock for health conditions such as elbow and hip dysplasia, heart disease, and two disorders that affect the eyelids: ectropion and entropion. As with all breeds, a Boerboel's ears should be checked regularly, and the teeth brushed often.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "Cardiac Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Boerboel is typically a healthy breed, and a responsible breeder will screen breeding stock for health conditions such as elbow and hip dysplasia, heart disease, and two disorders that affect the eyelids: ectropion and entropion. As with all breeds, a Boerboel's ears should be checked regularly, and the teeth brushed often.",
            "Training": "The Boerboel has a short, dense coat that sheds a moderate amount. Weekly brushing with a soft-bristle brush, a rubber grooming mitt, or a hound glove will help to remove any loose hair and keep the dog looking his best. A good brushing also promotes new hair growth and distributes skin oils throughout the coat to help keep it healthy. Boerboels need a bath only occasionally. As with all breeds, the Boerboel's nails should be trimmed regularly, as overly long nails can cause the dog pain as well as problems walking and running.",
            "Nutrition": "The strong, athletic Boerboel needs daily exercise, such as long walks on a leash or play sessions in a securely fenced area with his owner. Boerboels need mental stimulation and interaction with their owners along with physical activity. They will not take kindly to challenges from other dogs, and visiting dog parks is not recommended. Because of their protective instinct, the Boerboel should never be allowed off leash. The breed often enjoys participating in obedience, rally, weight pull, and agility competitions, as well as protection sports and stock work."
        }
    },
    "Bohemian Shepherd": {
        "url": "https://www.akc.org/dog-breeds/bohemian-shepherd/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "There are some diseases which affect the Bohemian Shepherd but so far nothing has suggested the breed suffers at a high degree to any particular disease. The clubs breeding program is aimed at reducing hip and elbow dysplasia, degenerative myelopathy, epilepsy and, most importantly, using genetic information to help maintain genetic diversity in the breed and reduce relatedness",
            "Training": "Grooming with the Bohemian Shepherd is quite easy. They are seasonal shedders and require a brushing once a week with an occasional bath.",
            "Nutrition": "The Bohemian Shepherd likes to be working in activities but is also able to relax with the family. They are a medium energy breed, and need daily exercise, training or play. Without daily exercise, the dogs energy will build over time and it can manifest in less desirable ways, like excessive barking or chewing."
        }
    },
    "Bolognese": {
        "url": "https://www.akc.org/dog-breeds/bolognese/",
        "scraped_data": {
            "Health": "The majority of Bolognese are healthy dogs, and a responsible breeder will screen breeding stock for health conditions such as luxating patellas (compared to \"trick knee\" in humans) and eye anomalies. Good breeders utilize health screening and genetic testing to reduce the likelihood of disease in their puppies.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "CERF",
                "Caer Eye Examination"
            ],
            "Grooming": null,
            "Exercise": "The majority of Bolognese are healthy dogs, and a responsible breeder will screen breeding stock for health conditions such as luxating patellas (compared to \"trick knee\" in humans) and eye anomalies. Good breeders utilize health screening and genetic testing to reduce the likelihood of disease in their puppies.",
            "Training": "The Bolognese has an all-white coat that is soft and fluffy like the texture of cotton. He is also 'non-shedding,' so low to mild allergy sufferers should not be greatly affected. Bolognese coats are unshaped and untrimmed except for around their eyes for sanitary reasons. Regular grooming is needed if the Bolognese is kept in its full coat. For easier maintenance, many people are satisfied with keeping their Bolo in a shorter coat of about one inch, leaving the untrimmed 'mop head' around the face.     Beyond regular grooming, the occasional bath will keep your Bolognese clean and looking his best. Nails should be trimmed occasionally with a nail clipper or grinder to avoid overgrowth, splitting and cracking. Ears should be checked regularly to avoid a buildup of wax and debris, which can result in an infection. Teeth should be brushed regularly.",
            "Nutrition": "Bolos would make great apartment dogs, provided they would still have a moderate exercise schedule. As a calm, easygoing dog, they would do well as companions for retirees and seniors. Options for exercise could include play time in the backyard, preferably fenced, or taken for walks. Indoor entertainment, like hide-and-seek, chasing a ball rolled along the floor, or teaching them new tricks are excellent low-key activities for the low-energy, but playful, Bolognese."
        }
    },
    "Border Collie": {
        "url": "https://www.akc.org/dog-breeds/border-collie/",
        "scraped_data": {
            "Health": "The Border Collie is generally a very hardy and healthy breed, and a responsible breeder will screen breeding stock for health conditions such as hip dysplasia, progressive renal atrophy, deafness, epilepsy, collie eye anomaly, neuronal ceroid lipofuscinosis, and trapped neutrophil syndrome. A BC's ears should be checked regularly for signs of infection, and the teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Border Collie is generally a very hardy and healthy breed, and a responsible breeder will screen breeding stock for health conditions such as hip dysplasia, progressive renal atrophy, deafness, epilepsy, collie eye anomaly, neuronal ceroid lipofuscinosis, and trapped neutrophil syndrome. A BC's ears should be checked regularly for signs of infection, and the teeth should be brushed regularly.",
            "Training": "There are two types of coat in the breed. The rough coat is medium-length and feathered, while the smooth coat is shorter and coarser. Both are dense, weather-resistant double coats. Grooming is the same for both: going over the dog with a pin brush once or twice a week, more often if needed, to keep the coat free of mats, tangles, dirt, and debris. During shedding season, daily brushing is required. As with all breeds, the BC's nails should be trimmed regularly.",
            "Nutrition": "This high-drive, athletic breed is extremely energetic and requires daily exercise beyond just a walk around the block or a quick romp in the yard. They thrive when they have a job to do and space to run. A Border Collie who doesn't work must be provided with vigorous exercise every day. Clearly, this is a breed for an active owner, and not for someone who prefers to stay indoors or who travels away from home frequently. BCs often participate (and excel) in herding events, not to mention obedience, agility, rally, and tracking competitions, and sports such as flying disc and flyball."
        }
    },
    "Border Terrier": {
        "url": "https://www.akc.org/dog-breeds/border-terrier/",
        "scraped_data": {
            "Health": "The Border Terrier is generally a healthy breed, and and a responsible breeder will screen breeding stock for health conditions such as hip dysplasia, progressive retinal atrophy, juvenile cataracts, seizures, heart problems, and allergies. Some Borders seem less tolerant of hot weather, so outdoor exercise should be kept to a minimum when the temperature gets above 85 degrees F.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "Hip Evaluation",
                "Spongiform Leukoencephalomyelopathy (SLEM) - DNA Test",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Border Terrier is generally a healthy breed, and and a responsible breeder will screen breeding stock for health conditions such as hip dysplasia, progressive retinal atrophy, juvenile cataracts, seizures, heart problems, and allergies. Some Borders seem less tolerant of hot weather, so outdoor exercise should be kept to a minimum when the temperature gets above 85 degrees F.",
            "Training": "The Border Terrier has a double coat: a hard, wiry outer coat over a soft, fluffy undercoat. Like most double-coated breeds, the Border sheds seasonally. Most of the time, a quick brushing every week or two is enough to keep the coat in good shape. During shedding season, owners can expect to spend a half-hour or so every day stripping out the dead hair, either with their hands or with a rake or stripping tool. The outer coat repels dirt, but bathing compromises this ability. Usually a dirty Border Terrier can be cleaned up with a towel and a brush. As with all breeds, the BT's nails should be trimmed regularly.",
            "Nutrition": "Borders are active dogs and need plenty of exercise daily. A brisk half-hour walk or play session with his owner and a ball or flying disc should be enough to keep a Border healthy and happy. Because of their instinct to chase small animals, a Border Terrier must always be walked on a leash, and play sessions must take place inside a fenced-in yard or other secure area. Terriers are diggers, so ideally any backyard fencing will extend underground for at least 18 inches. BTs enjoy participating in tracking, lure coursing, agility, and earthdog, as well as canine sports such as flyball."
        }
    },
    "Borzoi": {
        "url": "https://www.akc.org/dog-breeds/borzoi/",
        "scraped_data": {
            "Health": "Borzoi are generally healthy dogs,and a responsible breeder will screen breeding stock for health conditions such as elbow and hip dysplasia, osteochondritis dissecans, and progressive retinal atrophy. Like other large and deep-chested dogs, they can experience bloat, a sudden and life-threatening stomach condition. Owners should educate themselves as to what symptoms indicate this is occurring and what to do if so. Sighthounds, including Borzoi, are more sensitive to anesthesia than other breeds. As with all breeds, a Borzoi's ears should be checked regularly, and the teeth should be brushed often.",
            "Recommended Health Tests": [
                "Thyroid Evaluation",
                "Degenerative Myelopathy (DM) DNA SOD1A",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Borzoi are generally healthy dogs,and a responsible breeder will screen breeding stock for health conditions such as elbow and hip dysplasia, osteochondritis dissecans, and progressive retinal atrophy. Like other large and deep-chested dogs, they can experience bloat, a sudden and life-threatening stomach condition. Owners should educate themselves as to what symptoms indicate this is occurring and what to do if so. Sighthounds, including Borzoi, are more sensitive to anesthesia than other breeds. As with all breeds, a Borzoi's ears should be checked regularly, and the teeth should be brushed often.",
            "Training": "Like any long-coated dog, the Borzoi will shed a bit. In general, a quick brushing every day or two with a pin brush, slicker brush, and/or a comb will remove any loose hair and dirt from the coat. About once a year the Borzoi will shed more heavily for several weeks, and during this shedding season more frequent grooming is needed. Regular baths keep the Borzoi clean and looking his best. As with all breeds, the Borzoi's nails should be trimmed regularly.",
            "Nutrition": "Even though Borzoi are large, they are graceful, athletic animals who make good housedogs. They do need daily exercise, whether in the form of long walks or running in a securely fenced yard. Being sighthounds, they are apt to chase anything that moves, so they should always be in an enclosed area or on a leash. It is never advisable to allow a Borzoi to run loose. Borzoi enjoy doing activities with their owners and excel in canine sports such as agility and lure coursing."
        }
    },
    "Boston Terrier": {
        "url": "https://www.akc.org/dog-breeds/boston-terrier/",
        "scraped_data": {
            "Health": "Protecting the Boston Terrier's beautiful but prominent eyes is of special importance. The eyes should be checked daily for redness or irritation. Some owners carry saline eye drops to flush out dust or debris. Responsible breeders screen their stock for eye problems such as cataracts, corneal ulcers, and glaucoma, as well as deafness and patellar luxation (comparable to a \"trick knee\" in humans). Like all flat-faced breeds, Bostons can experience difficulty breathing when not given adequate shelter from excessive heat or humidity.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "BAER Testing",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Protecting the Boston Terrier's beautiful but prominent eyes is of special importance. The eyes should be checked daily for redness or irritation. Some owners carry saline eye drops to flush out dust or debris. Responsible breeders screen their stock for eye problems such as cataracts, corneal ulcers, and glaucoma, as well as deafness and patellar luxation (comparable to a \"trick knee\" in humans). Like all flat-faced breeds, Bostons can experience difficulty breathing when not given adequate shelter from excessive heat or humidity.",
            "Training": "The Boston's sleek, fine coat does shed somewhat, though not a lot. Weekly brushing with a soft-bristle brush, a rubber grooming mitt or tool, or a hound glove will help to remove the loose hair. A good brushing also promotes new hair growth and distributes skin oils throughout the coat to help keep it healthy. Bostons need to be bathed only occasionally, unless they get into something messy. As with all breeds, the Boston's nails should be trimmed regularly, because overly long nails can cause the dog pain as well as problems walking and running.",
            "Nutrition": "The Boston's need for exercise varies from individual to individual. For some, a brisk walk once or twice a day will be enough. Others will need more time to run and play every day and let off steam. Simply letting a Boston out into the backyard doesn't count as exercise'he'll probably just sit at the door waiting to be let back in. Left alone for long periods of time, a Boston will tend to become frustrated and develop undesirable behaviors. Throw him a ball or a toy, however, and he'll be more than happy to play with you. Participation in canine sports such as agility, obedience, flyball, and rally is an enjoyable way to channel the breed's energy."
        }
    },
    "Bouvier des Ardennes": {
        "url": "https://www.akc.org/dog-breeds/bouvier-de-ardennes/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "Like most other dogs their size and stature, it is important for breeders to test for hip and elbow dysplasia. While there is little research on the matter, a DNA test for Spinocerebellar Ataxia should also be considered.",
            "Training": "The Bouvier des Ardennes is a low-maintenance, no-fuss kind of dog. As he is designed to work long days outdoors in various weather conditions, their coat is resilient. The occasional bath and weekly brushing to prevent matting and to remove excess dirt is sufficient. Like some other rough-coated dogs, when their top coat reaches its fullest length, the dead roots are apparent and may shed itself. Because the dog is to be left rustically natural, the coat is not to be hand-stripped.",
            "Nutrition": "The Bouvier des Ardennes is born to hustle about the farm for various purposes throughout the day, never tiring, but is happy to retire for the evening when his master says his work is done. These dogs are generally not satiated with a walk around the neighborhood, free roam in a backyard, or a daily game of fetch. The Bouvier des Ardennes is a busy-body who can make trouble for his owner if he is not gainfully employed. If not living and working on a farm, a Bouvier des Ardennes can be just as happy in a rural home with regular free runs about the landscape, daily training, and regular sporting events."
        }
    },
    "Bouvier des Flandres": {
        "url": "https://www.akc.org/dog-breeds/bouvier-des-flandres/",
        "scraped_data": {
            "Health": "Bouviers are generally healthy dogs, and responsible breeders will screen their stock for health conditions such as Bouvier des Flandres myopathy, cataracts, deafness, ectopic ureters, epilepsy, glaucoma, hip dysplasia, hypothyroidism, laryngeal paralysis, megaesophagus, elbow dysplasia, portosystemic shunt, and subaortic stenosis. Like all large and deep-chested breeds, the Bouvier can experience gastric dilatation and bloat. Owners should learn how identify this potentially life-threatening condition and learn what emergency steps to take to address it.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Elbow Evaluation",
                "Cardiac Exam",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Bouviers are generally healthy dogs, and responsible breeders will screen their stock for health conditions such as Bouvier des Flandres myopathy, cataracts, deafness, ectopic ureters, epilepsy, glaucoma, hip dysplasia, hypothyroidism, laryngeal paralysis, megaesophagus, elbow dysplasia, portosystemic shunt, and subaortic stenosis. Like all large and deep-chested breeds, the Bouvier can experience gastric dilatation and bloat. Owners should learn how identify this potentially life-threatening condition and learn what emergency steps to take to address it.",
            "Training": "The Bouvier's coat needs brushing once or twice a week. A good slicker brush or pin brush and large comb will work for this. The beard may need cleaning at the same time, and the dog's toenails should be trimmed every week or two.",
            "Nutrition": "The Bouvier was bred to do everything that needs doing in a barnyard and pasture except milk the cows. They are happiest when they stay busy. A bored Bouvier can be a very destructive one. They are an excellent fit for an active household with an owner who hikes or jogs or even bikes. The Bouvier needs a large, enclosed exercise area where he can romp and play, preferably with other dogs or kids who will keep him in good condition both mentally and physically. Heavy exercise should be limited while he is a growing puppy."
        }
    },
    "Boxer": {
        "url": "https://www.akc.org/dog-breeds/boxer/",
        "scraped_data": {
            "Health": "The Boxer does not have a high tolerance for either extreme heat or cold, and he should always be kept inside the house as a beloved member of the family. Responsible breeders screen their stock for health conditions such as hip dysplasia, heart conditions such as aortic stenosis and cardiomyopathy, thyroid deficiency, degenerative myelopathy, and certain cancers. The website of the breed's national parent club, the American Boxer Club, provides in-depth details about the breed's health and care.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Thyroid Evaluation",
                "AS/SAS Cardio",
                "Aortic Valve Disease",
                "Holter Monitor Testing for Boxer Cardiomyopathy, Annually",
                "Degenerative Myelopathy (Common Variant) (DM) - DNA Test",
                "Arrhythmogenic Right Ventricular Cardiomyopathy (ARVC) - DNA Test",
                "Elbow Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Boxer does not have a high tolerance for either extreme heat or cold, and he should always be kept inside the house as a beloved member of the family. Responsible breeders screen their stock for health conditions such as hip dysplasia, heart conditions such as aortic stenosis and cardiomyopathy, thyroid deficiency, degenerative myelopathy, and certain cancers. The website of the breed's national parent club, the American Boxer Club, provides in-depth details about the breed's health and care.",
            "Training": "The Boxer's short, shiny coat requires very little grooming. A good once-over with a rubber curry-brush or a hound glove once or twice a week should keep him looking his best. The Boxer tends to be a clean dog, needing a bath only occasionally. His nails should be trimmed at least once a month unless naturally worn down on a hard surface, and to prevent tartar buildup his teeth should be brushed often'daily if possible.",
            "Nutrition": "Boxers are very playful, high-energy dogs. They need ample exercise every day, on leash or in a securely fenced area. The Boxer must never be allowed to run loose. The breed's heritage as a chaser of wild game means that they spend a good deal of time jumping and leaping about'as young dogs, they are constantly in need of reminders to teach them to stay 'down.' Because the Boxer is a powerful, active, and playful dog, he may not be the best choice for a very frail adult, nor for a small child who could be overwhelmed by a well-meaning but bouncy puppy."
        }
    },
    "Boykin Spaniel": {
        "url": "https://www.akc.org/dog-breeds/boykin-spaniel/",
        "scraped_data": {
            "Health": "Boykin Spaniels are generally healthy dogs, and responsible breeders screen their stock for health conditions such as hip dysplasia, juvenile cataracts, and exercise-induced collapse. The Boykin's ears should be checked regularly for signs of infection and cleaned when necessary'this can be done with soft gauze and an ear-cleaning solution, which the dog's breeder or veterinarian can recommend. The teeth should be brushed often, using a toothpaste designed for dogs.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "Hip Evaluation",
                "Exercise-Induced Collapse (EIC) - DNA Test",
                "Collie Eye Anomaly (CEA, CH) - DNA Test",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Boykin Spaniels are generally healthy dogs, and responsible breeders screen their stock for health conditions such as hip dysplasia, juvenile cataracts, and exercise-induced collapse. The Boykin's ears should be checked regularly for signs of infection and cleaned when necessary'this can be done with soft gauze and an ear-cleaning solution, which the dog's breeder or veterinarian can recommend. The teeth should be brushed often, using a toothpaste designed for dogs.",
            "Training": "The Boykin's medium-length, wavy coat requires only minimal maintenance. A weekly brushing will help to remove dirt and loose hair and keep him looking his best, and an occasional bath will help to keep him clean-smelling. As with all breeds, the nails should be trimmed regularly, as overly long nails can cause discomfort and problems walking and running.",
            "Nutrition": "Boykins have moderate to high energy and require lots of exercise every day. They do best with active people, especially those seeking an athletic partner for activities like hiking, running, or biking. Regular exercise will help keep the Boykin healthy and happy. This can come in the form of long walks and play sessions. The breed also exercises mind and body by participating in obedience, tracking, agility, rally, field events, and other activities that can be enjoyed by both dog and owner."
        }
    },
    "Bracco Italiano": {
        "url": "https://www.akc.org/dog-breeds/bracco-italiano/",
        "scraped_data": {
            "Health": "The Bracco is an overall healthy breed, and responsible breeders screen their stock for health conditions such as hip and elbow dysplasia, eye anomalies such as entropion, ectropion, and cataracts, and kidney disorders such as renal amyloidosis. To avoid orthopedic stresses on their fast-growing bodies, Bracco puppies should be fed a balanced food and should not be run on hard surfaces such as on concrete or perform repeated high-impact exercises until at least one year of age. Check the Bracco's long, pendulous ears for ear infections, and use a veterinarian-recommended ear cleaner once or twice weekly to keep the ear clean and dry to prevent infections.",
            "Recommended Health Tests": [
                "No recommended health tests"
            ],
            "Grooming": null,
            "Exercise": "The Bracco is an overall healthy breed, and responsible breeders screen their stock for health conditions such as hip and elbow dysplasia, eye anomalies such as entropion, ectropion, and cataracts, and kidney disorders such as renal amyloidosis. To avoid orthopedic stresses on their fast-growing bodies, Bracco puppies should be fed a balanced food and should not be run on hard surfaces such as on concrete or perform repeated high-impact exercises until at least one year of age. Check the Bracco's long, pendulous ears for ear infections, and use a veterinarian-recommended ear cleaner once or twice weekly to keep the ear clean and dry to prevent infections.",
            "Training": "Bracchi Italiani are easy to groom. Their short coats require minimal care and their long ears require routine cleaning to minimize the risk of ear infections. Beyond that, the occasional bath will keep them clean and looking their best. Their nails should be trimmed regularly with a nail clipper or grinder to avoid overgrowth, splitting and cracking. Teeth should be brushed regularly.",
            "Nutrition": "The Bracco is a moderate- to high-energy breed that requires daily exercise and mental stimulation. This can be accomplished by running free in a safe, enclosed space or by scheduled exercises such as daily jogs. At least 30 minutes of exercise per day is needed, but more is preferred. Furthermore, to be happy, they need time each day spent with their family doing organized training or playing."
        }
    },
    "Braque du Bourbonnais": {
        "url": "https://www.akc.org/dog-breeds/braque-du-bourbonnais/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "Most Bourbonnais Pointing Dogs are healthy dogs. Working with a responsible breeder, those wishing to own a Braque du Bourbonnais can gain the education they need to know about specific health concerns within the breed. Good breeders utilize health screening and genetic testing of their breeding stock to reduce the likelihood of disease in their puppies.",
            "Training": "The Braque du Bourbonnais has a fine, dense, short coat. It is a little coarser, and sometimes longer, on the back. On the head and ears, the hair is finer and shorter. Beyond periodic brushing, the occasional bath will keep your Braque du Bourbonnais clean and looking his best. Grooming can be a wonderful bonding experience for you and your dog. The breed's strong, fast-growing nails should be trimmed regularly with a nail clipper or grinder to avoid overgrowth, splitting and cracking. Ears should be checked regularly to avoid a buildup of wax and debris, which can result in infection. Teeth should be brushed regularly.",
            "Nutrition": "Options for exercise could include play time in the backyard, preferably fenced, or being taken for walks several times a day. Exercise can also come in the form of indoor activities, like hide-and-seek, chasing a ball rolled along the floor, or learning new tricks. Certain outdoor activities like swimming, hiking, and retrieving balls or flying discs can provide a good outlet for expending energy. Training for dog sports like agility, obedience and rally can also be a great way to give your dog exercise."
        }
    },
    "Braque Francais Pyrenean": {
        "url": "https://www.akc.org/dog-breeds/braque-francais-pyrenean/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "Most Pyrenean Type French Pointers are healthy dogs, and responsible breeders screen their stock for common health problems. Good breeders utilize health screening and genetic testing to reduce the likelihood of disease in their puppies.",
            "Training": "Beyond regular weekly grooming, the occasional bath will keep the Braque Francais Pyrenean clean and looking his best. Grooming can be a wonderful bonding experience for you and your dog. The breed's strong, fast-growing nails should be trimmed regularly with a nail clipper or grinder to avoid overgrowth, splitting and cracking. Ears should be checked regularly to avoid a buildup of wax and debris, which can result in infection. Teeth should be brushed regularly.",
            "Nutrition": "Options for exercise include play time in the backyard, preferably fenced, or being taken for walks several times a day. Exercise can also come in the form of indoor activities, like hide-and-seek, chasing a ball rolled along the floor, or learning new tricks. Certain outdoor activities like swimming, hiking, retrieving balls or flying discs can provide a good outlet for expending energy. Training for dog sports like agility, obedience and rally can also be a great way to give your dog exercise."
        }
    },
    "Braque Saint-Germain": {
        "url": "https://www.akc.org/dog-breeds/braque-saint-germain/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "Most Braque Saint-Germains are healthy dogs, and responsible breeders screen their stock for common health problems. Good breeders utilize health screening and genetic testing to reduce the likelihood of disease in their puppies.",
            "Training": "Beyond regular weekly grooming, the occasional bath will keep the Braque Saint-Germain clean and looking his best. Grooming can be a wonderful bonding experience for you and your dog. The breed's strong, fast-growing nails should be trimmed regularly with a nail clipper or grinder to avoid overgrowth, splitting and cracking. Ears should be checked regularly to avoid a buildup of wax and debris, which can result in infection. Teeth should be brushed regularly.",
            "Nutrition": "Options for exercise include play time in the backyard, preferably fenced, or being taken for walks several times a day. Exercise can also come in the form of indoor activities, like hide-and-seek, chasing a ball rolled along the floor, or learning new tricks. Certain outdoor activities like swimming, hiking, retrieving balls or flying discs can provide a good outlet for expending energy. Training for dog sports like agility, obedience and rally can also be a great way to give your dog exercise."
        }
    },
    "Brazilian Terrier": {
        "url": "https://www.akc.org/dog-breeds/brazilian-terrier/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "The breed is considered very rustic in terms of health. It has few typical diseases of the breed, such as Patellar Luxation and Mucopolysaccharidosis type VII (MPS VII), but even so, at low frequencies. The first can be detected by clinical tests and the second by genetic tests.",
            "Training": "The breed's grooming is very simple. In times of shedding, usually twice a year, brushing around 2 to 3 times a week. The rest of the year, little brushing is needed. It is not necessary to bathe very often. It is recommended only when the dog is really very dirty. When bathing, check the ears and nails.",
            "Nutrition": "The Brazilian terrier is a dog with a lot of energy, like most other terriers. Preferably, activities such as walking and sports should be carried out constantly, to satisfy the breed's need for exercise. For outdoor activities, lead the dog on a leash or in fenced areas."
        }
    },
    "Briard": {
        "url": "https://www.akc.org/dog-breeds/briard/",
        "scraped_data": {
            "Health": "The Briard is overall a healthy breed, and responsible breeders screen their stock for health conditions such as cancer, hip dysplasia, congenital stationary night blindness, cataracts, corneal dystrophy, retinal folds, hypothyroidism, immune diseases, exocrine pancreatic insufficiency, and kidney disease. Discuss any questions or concerns with your breeder and veterinarian so you can make educated decisions regarding your dog's health.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Congenital Stationary Night Blindness (CSNB, LCA) - DNA Test",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Briard is overall a healthy breed, and responsible breeders screen their stock for health conditions such as cancer, hip dysplasia, congenital stationary night blindness, cataracts, corneal dystrophy, retinal folds, hypothyroidism, immune diseases, exocrine pancreatic insufficiency, and kidney disease. Discuss any questions or concerns with your breeder and veterinarian so you can make educated decisions regarding your dog's health.",
            "Training": "Begin grooming your Briard puppy long before he really needs grooming. Make sure that you make grooming time a happy period he will look forward to in the years when grooming is a necessity and can take a long time. A Briard should be brushed several times a week, completely to the skin, using a good-quality pin brush. Using an undercoat rake can help eliminate a lot of dead hair and lessen shedding. The number of baths a Briard will need depends entirely on his lifestyle and the jobs he is doing. Frequency may range from weekly to monthly, to even less.",
            "Nutrition": "The Briard requires a job to be happy. Hopefully his job will be one that gives him a lot of exercise, as this is a breed that craves action. Their zest for life makes them great companions for hikers, bicyclers, and joggers. They need a large, securely fenced area where they can run free. Chasing a tennis ball thrown by his owner can help a Briard work off excess energy as well as giving him the human companionship he loves."
        }
    },
    "Brittany": {
        "url": "https://www.akc.org/dog-breeds/brittany/",
        "scraped_data": {
            "Health": "The Brittany is a very healthy breed, with few genetic health issues. A responsible breeder will screen breeding stock for health concerns such as hip dysplasia and eye disease. Ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and the teeth should be brushed regularly.",
            "Recommended Health Tests": [
                "Hip Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "The Brittany is a very healthy breed, with few genetic health issues. A responsible breeder will screen breeding stock for health concerns such as hip dysplasia and eye disease. Ears should be checked regularly to remove foreign matter and avoid a buildup of wax, and the teeth should be brushed regularly.",
            "Training": "The Brittany's flat or wavy coat is mostly fairly short and requires minimal grooming. A once-over with a soft brush or hound glove and a quick comb-through of his featherings should keep him looking his best. For the show ring there is some light trimming done to neaten the dog's head and neck. The underside of the ears should be inspected regularly and wiped clean if needed, and the nails trimmed every month if not naturally worn down.",
            "Nutrition": "The Brittany is a bright, high-energy dog who is bred to hunt, and he needs lots of exercise. Brittanys are a good fit for those seeking an all-purpose hunting partner, a dog-sport teammate, or a loyal companion suited to a lively, outdoorsy family life. He enjoys long, brisk walks and hikes or running on a leash alongside his human, as well as a wide variety of activities that occupy both his mind and his body. As well as field trials, other canine events such as agility, FAST CAT , and dock diving provide great outlets for the breed's talent and boundless energy."
        }
    },
    "Broholmer": {
        "url": "https://www.akc.org/dog-breeds/broholmer/",
        "scraped_data": {
            "Health": null,
            "Recommended Health Tests": null,
            "Grooming": null,
            "Exercise": "Most Broholmers are healthy dogs. Working with a responsible breeder, those wishing to own a Broholmer can gain the education they need to know about specific health concerns within the breed. Good breeders utilize health screening and genetic testing of their breeding stock to reduce the likelihood of disease in their puppies.",
            "Training": "Beyond regular weekly grooming, the occasional bath will keep your Broholmer clean and looking his best. Grooming can be a wonderful bonding experience for you and your dog. Keep strong, fast-growing nails trimmed regularly with a nail clipper or grinder to avoid overgrowth, splitting and cracking. Ears should be checked regularly to avoid a buildup of wax and debris, which can result in infection. Teeth should be brushed regularly.",
            "Nutrition": "Options for exercise include play time in the backyard, preferably fenced, or taken for walks several times a day. Exercise can also come in the form of indoor activities, like hide-and-seek, chasing a ball rolled along the floor, or teaching them new tricks. Certain outdoor activities like swimming, hiking, retrieving balls or flying discs can provide a good outlet for expending energy. Training for dog sports like agility, obedience and rally can also be a great way to give your dog exercise."
        }
    },
    "Brussels Griffon": {
        "url": "https://www.akc.org/dog-breeds/brussels-griffon/",
        "scraped_data": {
            "Health": "Griffs are generally healthy dogs, and responsible breeders screen their stock for health conditions such as heart problems, eye defects such as cataracts, and orthopedic problems such as patella luxation and hip dysplasia. Like all flat-faced breeds, Brussels Griffons can experience breathing problems in sunny, hot, or humid weather, and usually snore. As with all breeds, a Griffon's ears should be checked regularly for signs of infection, and the teeth should be brushed often, using a toothpaste designed for dogs.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "Hip Evaluation",
                "Ophthalmologist Evaluation"
            ],
            "Grooming": null,
            "Exercise": "Griffs are generally healthy dogs, and responsible breeders screen their stock for health conditions such as heart problems, eye defects such as cataracts, and orthopedic problems such as patella luxation and hip dysplasia. Like all flat-faced breeds, Brussels Griffons can experience breathing problems in sunny, hot, or humid weather, and usually snore. As with all breeds, a Griffon's ears should be checked regularly for signs of infection, and the teeth should be brushed often, using a toothpaste designed for dogs.",
            "Training": "There are two types of Brussels Griffon, with two types of coats: smooth and rough. With the smooth-coated Griffon, weekly brushing'daily during shedding season, which is usually a week or two in the spring, and then again in the fall'and the occasional bath will help to remove dirt and loose hair and keep the dog looking his best. Rough-coated Griffons do not shed. Many have their hair'except for the distinctive beard'clipped short, either by their owner or a professional groomer. As with all breeds, the nails should be trimmed regularly, as overly long nails can be painful to the dog and cause problems walking and running.",
            "Nutrition": "Griffons need at least a half-hour of moderate exercise a day to stay healthy and happy. They love to romp and play, and are happiest when doing activities together with their people. A game of chasing the ball is fun for both dog and owner. Their intelligence and trainability mean that many Brussels Griffons excel in canine events such as obedience, agility, and tracking."
        }
    },
    "Bull Terrier": {
        "url": "https://www.akc.org/dog-breeds/bull-terrier/",
        "scraped_data": {
            "Health": "Owners of potential sires and dams being bred should show proof of testing for kidney and heart issues, and pups should be tested for hearing before leaving the breeder. Dedicated breeders communicate with each other regularly and work together for breed health and the preservation of the breed's best qualities. Bull Terriers from good breeders who health-test usually become healthy, happy, family members.",
            "Recommended Health Tests": [
                "Patella Evaluation",
                "BAER Testing",
                "Kidney - Urine Protein:Creatinine Ratio",
                "Cardiac Exam"
            ],
            "Grooming": null,
            "Exercise": "Owners of potential sires and dams being bred should show proof of testing for kidney and heart issues, and pups should be tested for hearing before leaving the breeder. Dedicated breeders communicate with each other regularly and work together for breed health and the preservation of the breed's best qualities. Bull Terriers from good breeders who health-test usually become healthy, happy, family members.",
            "Training": "The Bull Terrier's short, flat, harsh, and glossy coat requires minimal maintenance. A weekly brushing with a soft-bristle brush or a hound glove will help to remove dirt and loose hair and keep the dog looking his best. The ears  should be regularly inspected and cleaned if needed. The nails should be trimmed often, as overly long nails can cause the dog discomfort and problems walking and running.",
            "Nutrition": "Bull Terriers benefit from daily, moderate exercise that provides good mental and physical stimulation, such as nice, long walks with the family. The breed was developed for sport as well as to be a gentleman's companion and possesses great strength and agility. Participation in canine sports such as obedience, tracking, agility, and coursing ability tests is an enjoyable way to channel the BT's energy."
        }
    }
}